Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x905 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 21 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x1cf91): GNU C11 12.3.1 20230626 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x62f48): ../Core/Src/freertos.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x877e4): E:/Mcnex/IR_Fillter/IR_Fillter_RTOS/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 22 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 7 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 4
    <33>   DW_AT_encoding    : 7	(unsigned)
    <34>   DW_AT_name        : (indirect string, offset: 0xc2e5): unsigned int
 <1><38>: Abbrev Number: 7 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x42985): long long int
 <1><3f>: Abbrev Number: 7 (DW_TAG_base_type)
    <40>   DW_AT_byte_size   : 8
    <41>   DW_AT_encoding    : 4	(float)
    <42>   DW_AT_name        : (indirect string, offset: 0x9541e): long double
 <1><46>: Abbrev Number: 7 (DW_TAG_base_type)
    <47>   DW_AT_byte_size   : 1
    <48>   DW_AT_encoding    : 6	(signed char)
    <49>   DW_AT_name        : (indirect string, offset: 0x48c28): signed char
 <1><4d>: Abbrev Number: 4 (DW_TAG_typedef)
    <4e>   DW_AT_name        : (indirect string, offset: 0x2a488): __uint8_t
    <52>   DW_AT_decl_file   : 2
    <53>   DW_AT_decl_line   : 43
    <54>   DW_AT_decl_column : 24
    <55>   DW_AT_type        : <0x59>
 <1><59>: Abbrev Number: 7 (DW_TAG_base_type)
    <5a>   DW_AT_byte_size   : 1
    <5b>   DW_AT_encoding    : 8	(unsigned char)
    <5c>   DW_AT_name        : (indirect string, offset: 0x1d5fa): unsigned char
 <1><60>: Abbrev Number: 7 (DW_TAG_base_type)
    <61>   DW_AT_byte_size   : 2
    <62>   DW_AT_encoding    : 5	(signed)
    <63>   DW_AT_name        : (indirect string, offset: 0x6c8cd): short int
 <1><67>: Abbrev Number: 4 (DW_TAG_typedef)
    <68>   DW_AT_name        : (indirect string, offset: 0x76cfb): __uint16_t
    <6c>   DW_AT_decl_file   : 2
    <6d>   DW_AT_decl_line   : 57
    <6e>   DW_AT_decl_column : 25
    <6f>   DW_AT_type        : <0x73>
 <1><73>: Abbrev Number: 7 (DW_TAG_base_type)
    <74>   DW_AT_byte_size   : 2
    <75>   DW_AT_encoding    : 7	(unsigned)
    <76>   DW_AT_name        : (indirect string, offset: 0x2f8e4): short unsigned int
 <1><7a>: Abbrev Number: 7 (DW_TAG_base_type)
    <7b>   DW_AT_byte_size   : 4
    <7c>   DW_AT_encoding    : 5	(signed)
    <7d>   DW_AT_name        : (indirect string, offset: 0xc9a3): long int
 <1><81>: Abbrev Number: 4 (DW_TAG_typedef)
    <82>   DW_AT_name        : (indirect string, offset: 0x5c7c7): __uint32_t
    <86>   DW_AT_decl_file   : 2
    <87>   DW_AT_decl_line   : 79
    <88>   DW_AT_decl_column : 25
    <89>   DW_AT_type        : <0x8d>
 <1><8d>: Abbrev Number: 7 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0x21fab): long unsigned int
 <1><94>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <95>   DW_AT_type        : <0x8d>
 <1><99>: Abbrev Number: 7 (DW_TAG_base_type)
    <9a>   DW_AT_byte_size   : 8
    <9b>   DW_AT_encoding    : 7	(unsigned)
    <9c>   DW_AT_name        : (indirect string, offset: 0x1e0bb): long long unsigned int
 <1><a0>: Abbrev Number: 4 (DW_TAG_typedef)
    <a1>   DW_AT_name        : (indirect string, offset: 0x2a48a): uint8_t
    <a5>   DW_AT_decl_file   : 3
    <a6>   DW_AT_decl_line   : 24
    <a7>   DW_AT_decl_column : 19
    <a8>   DW_AT_type        : <0x4d>
 <1><ac>: Abbrev Number: 4 (DW_TAG_typedef)
    <ad>   DW_AT_name        : (indirect string, offset: 0x6a5c0): uint16_t
    <b1>   DW_AT_decl_file   : 3
    <b2>   DW_AT_decl_line   : 36
    <b3>   DW_AT_decl_column : 20
    <b4>   DW_AT_type        : <0x67>
 <1><b8>: Abbrev Number: 4 (DW_TAG_typedef)
    <b9>   DW_AT_name        : (indirect string, offset: 0x69eda): uint32_t
    <bd>   DW_AT_decl_file   : 3
    <be>   DW_AT_decl_line   : 48
    <bf>   DW_AT_decl_column : 20
    <c0>   DW_AT_type        : <0x81>
 <1><c4>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <c5>   DW_AT_type        : <0xb8>
 <1><c9>: Abbrev Number: 23 (DW_TAG_pointer_type)
    <ca>   DW_AT_byte_size   : 4
 <1><cb>: Abbrev Number: 4 (DW_TAG_typedef)
    <cc>   DW_AT_name        : (indirect string, offset: 0x6a878): StackType_t
    <d0>   DW_AT_decl_file   : 4
    <d1>   DW_AT_decl_line   : 55
    <d2>   DW_AT_decl_column : 24
    <d3>   DW_AT_type        : <0xb8>
 <1><d7>: Abbrev Number: 4 (DW_TAG_typedef)
    <d8>   DW_AT_name        : (indirect string, offset: 0x84efa): UBaseType_t
    <dc>   DW_AT_decl_file   : 4
    <dd>   DW_AT_decl_line   : 57
    <de>   DW_AT_decl_column : 23
    <df>   DW_AT_type        : <0x8d>
 <1><e3>: Abbrev Number: 4 (DW_TAG_typedef)
    <e4>   DW_AT_name        : (indirect string, offset: 0x4faae): TickType_t
    <e8>   DW_AT_decl_file   : 4
    <e9>   DW_AT_decl_line   : 63
    <ea>   DW_AT_decl_column : 19
    <eb>   DW_AT_type        : <0xb8>
 <1><ef>: Abbrev Number: 17 (DW_TAG_structure_type)
    <f0>   DW_AT_name        : (indirect string, offset: 0x79a1e): xSTATIC_LIST_ITEM
    <f4>   DW_AT_byte_size   : 20
    <f5>   DW_AT_decl_file   : 5
    <f5>   DW_AT_decl_line   : 1061
    <f7>   DW_AT_decl_column : 8
    <f8>   DW_AT_sibling     : <0x119>
 <2><fc>: Abbrev Number: 1 (DW_TAG_member)
    <fd>   DW_AT_name        : (indirect string, offset: 0x941b9): xDummy2
    <101>   DW_AT_decl_file   : 5
    <102>   DW_AT_decl_line   : 1066
    <104>   DW_AT_decl_column : 13
    <105>   DW_AT_type        : <0xe3>
    <109>   DW_AT_data_member_location: 0
 <2><10a>: Abbrev Number: 1 (DW_TAG_member)
    <10b>   DW_AT_name        : (indirect string, offset: 0x34aaa): pvDummy3
    <10f>   DW_AT_decl_file   : 5
    <110>   DW_AT_decl_line   : 1067
    <112>   DW_AT_decl_column : 8
    <113>   DW_AT_type        : <0x119>
    <117>   DW_AT_data_member_location: 4
 <2><118>: Abbrev Number: 0
 <1><119>: Abbrev Number: 9 (DW_TAG_array_type)
    <11a>   DW_AT_type        : <0xc9>
    <11e>   DW_AT_sibling     : <0x129>
 <2><122>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <123>   DW_AT_type        : <0x31>
    <127>   DW_AT_upper_bound : 3
 <2><128>: Abbrev Number: 0
 <1><129>: Abbrev Number: 8 (DW_TAG_typedef)
    <12a>   DW_AT_name        : (indirect string, offset: 0x34c3b): StaticListItem_t
    <12e>   DW_AT_decl_file   : 5
    <12f>   DW_AT_decl_line   : 1072
    <131>   DW_AT_decl_column : 34
    <132>   DW_AT_type        : <0xef>
 <1><136>: Abbrev Number: 17 (DW_TAG_structure_type)
    <137>   DW_AT_name        : (indirect string, offset: 0x612d1): xSTATIC_TCB
    <13b>   DW_AT_byte_size   : 104
    <13c>   DW_AT_decl_file   : 5
    <13c>   DW_AT_decl_line   : 1112
    <13e>   DW_AT_decl_column : 16
    <13f>   DW_AT_sibling     : <0x1fa>
 <2><143>: Abbrev Number: 1 (DW_TAG_member)
    <144>   DW_AT_name        : (indirect string, offset: 0x1d608): pxDummy1
    <148>   DW_AT_decl_file   : 5
    <149>   DW_AT_decl_line   : 1114
    <14b>   DW_AT_decl_column : 11
    <14c>   DW_AT_type        : <0xc9>
    <150>   DW_AT_data_member_location: 0
 <2><151>: Abbrev Number: 1 (DW_TAG_member)
    <152>   DW_AT_name        : (indirect string, offset: 0x1b7bb): xDummy3
    <156>   DW_AT_decl_file   : 5
    <157>   DW_AT_decl_line   : 1118
    <159>   DW_AT_decl_column : 19
    <15a>   DW_AT_type        : <0x1fa>
    <15e>   DW_AT_data_member_location: 4
 <2><15f>: Abbrev Number: 1 (DW_TAG_member)
    <160>   DW_AT_name        : (indirect string, offset: 0x13f40): uxDummy5
    <164>   DW_AT_decl_file   : 5
    <165>   DW_AT_decl_line   : 1119
    <167>   DW_AT_decl_column : 16
    <168>   DW_AT_type        : <0xd7>
    <16c>   DW_AT_data_member_location: 44
 <2><16d>: Abbrev Number: 1 (DW_TAG_member)
    <16e>   DW_AT_name        : (indirect string, offset: 0x1d62b): pxDummy6
    <172>   DW_AT_decl_file   : 5
    <173>   DW_AT_decl_line   : 1120
    <175>   DW_AT_decl_column : 11
    <176>   DW_AT_type        : <0xc9>
    <17a>   DW_AT_data_member_location: 48
 <2><17b>: Abbrev Number: 1 (DW_TAG_member)
    <17c>   DW_AT_name        : (indirect string, offset: 0x3389e): ucDummy7
    <180>   DW_AT_decl_file   : 5
    <181>   DW_AT_decl_line   : 1121
    <183>   DW_AT_decl_column : 13
    <184>   DW_AT_type        : <0x20a>
    <188>   DW_AT_data_member_location: 52
 <2><189>: Abbrev Number: 1 (DW_TAG_member)
    <18a>   DW_AT_name        : (indirect string, offset: 0x1d634): pxDummy8
    <18e>   DW_AT_decl_file   : 5
    <18f>   DW_AT_decl_line   : 1123
    <191>   DW_AT_decl_column : 11
    <192>   DW_AT_type        : <0xc9>
    <196>   DW_AT_data_member_location: 68
 <2><197>: Abbrev Number: 1 (DW_TAG_member)
    <198>   DW_AT_name        : (indirect string, offset: 0x82cab): uxDummy10
    <19c>   DW_AT_decl_file   : 5
    <19d>   DW_AT_decl_line   : 1129
    <19f>   DW_AT_decl_column : 16
    <1a0>   DW_AT_type        : <0x21a>
    <1a4>   DW_AT_data_member_location: 72
 <2><1a5>: Abbrev Number: 1 (DW_TAG_member)
    <1a6>   DW_AT_name        : (indirect string, offset: 0x1fc64): uxDummy12
    <1aa>   DW_AT_decl_file   : 5
    <1ab>   DW_AT_decl_line   : 1132
    <1ad>   DW_AT_decl_column : 16
    <1ae>   DW_AT_type        : <0x21a>
    <1b2>   DW_AT_data_member_location: 80
 <2><1b3>: Abbrev Number: 1 (DW_TAG_member)
    <1b4>   DW_AT_name        : (indirect string, offset: 0x32e8): pxDummy14
    <1b8>   DW_AT_decl_file   : 5
    <1b9>   DW_AT_decl_line   : 1135
    <1bb>   DW_AT_decl_column : 11
    <1bc>   DW_AT_type        : <0xc9>
    <1c0>   DW_AT_data_member_location: 88
 <2><1c1>: Abbrev Number: 1 (DW_TAG_member)
    <1c2>   DW_AT_name        : (indirect string, offset: 0x14e5c): ulDummy16
    <1c6>   DW_AT_decl_file   : 5
    <1c7>   DW_AT_decl_line   : 1141
    <1c9>   DW_AT_decl_column : 13
    <1ca>   DW_AT_type        : <0xb8>
    <1ce>   DW_AT_data_member_location: 92
 <2><1cf>: Abbrev Number: 1 (DW_TAG_member)
    <1d0>   DW_AT_name        : (indirect string, offset: 0x14e66): ulDummy18
    <1d4>   DW_AT_decl_file   : 5
    <1d5>   DW_AT_decl_line   : 1147
    <1d7>   DW_AT_decl_column : 14
    <1d8>   DW_AT_type        : <0xb8>
    <1dc>   DW_AT_data_member_location: 96
 <2><1dd>: Abbrev Number: 1 (DW_TAG_member)
    <1de>   DW_AT_name        : (indirect string, offset: 0x2cbd7): ucDummy19
    <1e2>   DW_AT_decl_file   : 5
    <1e3>   DW_AT_decl_line   : 1148
    <1e5>   DW_AT_decl_column : 13
    <1e6>   DW_AT_type        : <0xa0>
    <1ea>   DW_AT_data_member_location: 100
 <2><1eb>: Abbrev Number: 1 (DW_TAG_member)
    <1ec>   DW_AT_name        : (indirect string, offset: 0x830b3): uxDummy20
    <1f0>   DW_AT_decl_file   : 5
    <1f1>   DW_AT_decl_line   : 1151
    <1f3>   DW_AT_decl_column : 13
    <1f4>   DW_AT_type        : <0xa0>
    <1f8>   DW_AT_data_member_location: 101
 <2><1f9>: Abbrev Number: 0
 <1><1fa>: Abbrev Number: 9 (DW_TAG_array_type)
    <1fb>   DW_AT_type        : <0x129>
    <1ff>   DW_AT_sibling     : <0x20a>
 <2><203>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <204>   DW_AT_type        : <0x31>
    <208>   DW_AT_upper_bound : 1
 <2><209>: Abbrev Number: 0
 <1><20a>: Abbrev Number: 9 (DW_TAG_array_type)
    <20b>   DW_AT_type        : <0xa0>
    <20f>   DW_AT_sibling     : <0x21a>
 <2><213>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <214>   DW_AT_type        : <0x31>
    <218>   DW_AT_upper_bound : 15
 <2><219>: Abbrev Number: 0
 <1><21a>: Abbrev Number: 9 (DW_TAG_array_type)
    <21b>   DW_AT_type        : <0xd7>
    <21f>   DW_AT_sibling     : <0x22a>
 <2><223>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <224>   DW_AT_type        : <0x31>
    <228>   DW_AT_upper_bound : 1
 <2><229>: Abbrev Number: 0
 <1><22a>: Abbrev Number: 8 (DW_TAG_typedef)
    <22b>   DW_AT_name        : (indirect string, offset: 0x47cfe): StaticTask_t
    <22f>   DW_AT_decl_file   : 5
    <230>   DW_AT_decl_line   : 1160
    <232>   DW_AT_decl_column : 3
    <233>   DW_AT_type        : <0x136>
 <1><237>: Abbrev Number: 7 (DW_TAG_base_type)
    <238>   DW_AT_byte_size   : 1
    <239>   DW_AT_encoding    : 8	(unsigned char)
    <23a>   DW_AT_name        : (indirect string, offset: 0x2efa4): char
 <1><23e>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <23f>   DW_AT_byte_size   : 4
    <23f>   DW_AT_type        : <0xcb>
 <1><243>: Abbrev Number: 13 (DW_TAG_structure_type)
    <244>   DW_AT_byte_size   : 16
    <245>   DW_AT_decl_file   : 6
    <246>   DW_AT_decl_line   : 290
    <248>   DW_AT_decl_column : 9
    <248>   DW_AT_sibling     : <0x283>
 <2><24c>: Abbrev Number: 6 (DW_TAG_member)
    <24d>   DW_AT_name        : CCR
    <251>   DW_AT_decl_file   : 6
    <251>   DW_AT_decl_line   : 292
    <253>   DW_AT_decl_column : 17
    <253>   DW_AT_type        : <0xc4>
    <257>   DW_AT_data_member_location: 0
 <2><258>: Abbrev Number: 1 (DW_TAG_member)
    <259>   DW_AT_name        : (indirect string, offset: 0x3857d): CNDTR
    <25d>   DW_AT_decl_file   : 6
    <25e>   DW_AT_decl_line   : 293
    <260>   DW_AT_decl_column : 17
    <261>   DW_AT_type        : <0xc4>
    <265>   DW_AT_data_member_location: 4
 <2><266>: Abbrev Number: 1 (DW_TAG_member)
    <267>   DW_AT_name        : (indirect string, offset: 0x8b617): CPAR
    <26b>   DW_AT_decl_file   : 6
    <26c>   DW_AT_decl_line   : 294
    <26e>   DW_AT_decl_column : 17
    <26f>   DW_AT_type        : <0xc4>
    <273>   DW_AT_data_member_location: 8
 <2><274>: Abbrev Number: 1 (DW_TAG_member)
    <275>   DW_AT_name        : (indirect string, offset: 0x500d8): CMAR
    <279>   DW_AT_decl_file   : 6
    <27a>   DW_AT_decl_line   : 295
    <27c>   DW_AT_decl_column : 17
    <27d>   DW_AT_type        : <0xc4>
    <281>   DW_AT_data_member_location: 12
 <2><282>: Abbrev Number: 0
 <1><283>: Abbrev Number: 8 (DW_TAG_typedef)
    <284>   DW_AT_name        : (indirect string, offset: 0x764e7): DMA_Channel_TypeDef
    <288>   DW_AT_decl_file   : 6
    <289>   DW_AT_decl_line   : 296
    <28b>   DW_AT_decl_column : 3
    <28c>   DW_AT_type        : <0x243>
 <1><290>: Abbrev Number: 13 (DW_TAG_structure_type)
    <291>   DW_AT_byte_size   : 8
    <292>   DW_AT_decl_file   : 6
    <293>   DW_AT_decl_line   : 298
    <295>   DW_AT_decl_column : 9
    <295>   DW_AT_sibling     : <0x2b4>
 <2><299>: Abbrev Number: 6 (DW_TAG_member)
    <29a>   DW_AT_name        : ISR
    <29e>   DW_AT_decl_file   : 6
    <29e>   DW_AT_decl_line   : 300
    <2a0>   DW_AT_decl_column : 17
    <2a0>   DW_AT_type        : <0xc4>
    <2a4>   DW_AT_data_member_location: 0
 <2><2a5>: Abbrev Number: 1 (DW_TAG_member)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x660df): IFCR
    <2aa>   DW_AT_decl_file   : 6
    <2ab>   DW_AT_decl_line   : 301
    <2ad>   DW_AT_decl_column : 17
    <2ae>   DW_AT_type        : <0xc4>
    <2b2>   DW_AT_data_member_location: 4
 <2><2b3>: Abbrev Number: 0
 <1><2b4>: Abbrev Number: 8 (DW_TAG_typedef)
    <2b5>   DW_AT_name        : (indirect string, offset: 0x34f8f): DMA_TypeDef
    <2b9>   DW_AT_decl_file   : 6
    <2ba>   DW_AT_decl_line   : 302
    <2bc>   DW_AT_decl_column : 3
    <2bd>   DW_AT_type        : <0x290>
 <1><2c1>: Abbrev Number: 13 (DW_TAG_structure_type)
    <2c2>   DW_AT_byte_size   : 84
    <2c3>   DW_AT_decl_file   : 6
    <2c4>   DW_AT_decl_line   : 476
    <2c6>   DW_AT_decl_column : 9
    <2c6>   DW_AT_sibling     : <0x3db>
 <2><2ca>: Abbrev Number: 6 (DW_TAG_member)
    <2cb>   DW_AT_name        : CR1
    <2cf>   DW_AT_decl_file   : 6
    <2cf>   DW_AT_decl_line   : 478
    <2d1>   DW_AT_decl_column : 17
    <2d1>   DW_AT_type        : <0xc4>
    <2d5>   DW_AT_data_member_location: 0
 <2><2d6>: Abbrev Number: 6 (DW_TAG_member)
    <2d7>   DW_AT_name        : CR2
    <2db>   DW_AT_decl_file   : 6
    <2db>   DW_AT_decl_line   : 479
    <2dd>   DW_AT_decl_column : 17
    <2dd>   DW_AT_type        : <0xc4>
    <2e1>   DW_AT_data_member_location: 4
 <2><2e2>: Abbrev Number: 1 (DW_TAG_member)
    <2e3>   DW_AT_name        : (indirect string, offset: 0x68c6a): SMCR
    <2e7>   DW_AT_decl_file   : 6
    <2e8>   DW_AT_decl_line   : 480
    <2ea>   DW_AT_decl_column : 17
    <2eb>   DW_AT_type        : <0xc4>
    <2ef>   DW_AT_data_member_location: 8
 <2><2f0>: Abbrev Number: 1 (DW_TAG_member)
    <2f1>   DW_AT_name        : (indirect string, offset: 0x2e6d8): DIER
    <2f5>   DW_AT_decl_file   : 6
    <2f6>   DW_AT_decl_line   : 481
    <2f8>   DW_AT_decl_column : 17
    <2f9>   DW_AT_type        : <0xc4>
    <2fd>   DW_AT_data_member_location: 12
 <2><2fe>: Abbrev Number: 6 (DW_TAG_member)
    <2ff>   DW_AT_name        : SR
    <302>   DW_AT_decl_file   : 6
    <302>   DW_AT_decl_line   : 482
    <304>   DW_AT_decl_column : 17
    <304>   DW_AT_type        : <0xc4>
    <308>   DW_AT_data_member_location: 16
 <2><309>: Abbrev Number: 6 (DW_TAG_member)
    <30a>   DW_AT_name        : EGR
    <30e>   DW_AT_decl_file   : 6
    <30e>   DW_AT_decl_line   : 483
    <310>   DW_AT_decl_column : 17
    <310>   DW_AT_type        : <0xc4>
    <314>   DW_AT_data_member_location: 20
 <2><315>: Abbrev Number: 1 (DW_TAG_member)
    <316>   DW_AT_name        : (indirect string, offset: 0x6aa51): CCMR1
    <31a>   DW_AT_decl_file   : 6
    <31b>   DW_AT_decl_line   : 484
    <31d>   DW_AT_decl_column : 17
    <31e>   DW_AT_type        : <0xc4>
    <322>   DW_AT_data_member_location: 24
 <2><323>: Abbrev Number: 1 (DW_TAG_member)
    <324>   DW_AT_name        : (indirect string, offset: 0x3a2f8): CCMR2
    <328>   DW_AT_decl_file   : 6
    <329>   DW_AT_decl_line   : 485
    <32b>   DW_AT_decl_column : 17
    <32c>   DW_AT_type        : <0xc4>
    <330>   DW_AT_data_member_location: 28
 <2><331>: Abbrev Number: 1 (DW_TAG_member)
    <332>   DW_AT_name        : (indirect string, offset: 0x19879): CCER
    <336>   DW_AT_decl_file   : 6
    <337>   DW_AT_decl_line   : 486
    <339>   DW_AT_decl_column : 17
    <33a>   DW_AT_type        : <0xc4>
    <33e>   DW_AT_data_member_location: 32
 <2><33f>: Abbrev Number: 6 (DW_TAG_member)
    <340>   DW_AT_name        : CNT
    <344>   DW_AT_decl_file   : 6
    <344>   DW_AT_decl_line   : 487
    <346>   DW_AT_decl_column : 17
    <346>   DW_AT_type        : <0xc4>
    <34a>   DW_AT_data_member_location: 36
 <2><34b>: Abbrev Number: 6 (DW_TAG_member)
    <34c>   DW_AT_name        : PSC
    <350>   DW_AT_decl_file   : 6
    <350>   DW_AT_decl_line   : 488
    <352>   DW_AT_decl_column : 17
    <352>   DW_AT_type        : <0xc4>
    <356>   DW_AT_data_member_location: 40
 <2><357>: Abbrev Number: 6 (DW_TAG_member)
    <358>   DW_AT_name        : ARR
    <35c>   DW_AT_decl_file   : 6
    <35c>   DW_AT_decl_line   : 489
    <35e>   DW_AT_decl_column : 17
    <35e>   DW_AT_type        : <0xc4>
    <362>   DW_AT_data_member_location: 44
 <2><363>: Abbrev Number: 6 (DW_TAG_member)
    <364>   DW_AT_name        : RCR
    <368>   DW_AT_decl_file   : 6
    <368>   DW_AT_decl_line   : 490
    <36a>   DW_AT_decl_column : 17
    <36a>   DW_AT_type        : <0xc4>
    <36e>   DW_AT_data_member_location: 48
 <2><36f>: Abbrev Number: 1 (DW_TAG_member)
    <370>   DW_AT_name        : (indirect string, offset: 0x11665): CCR1
    <374>   DW_AT_decl_file   : 6
    <375>   DW_AT_decl_line   : 491
    <377>   DW_AT_decl_column : 17
    <378>   DW_AT_type        : <0xc4>
    <37c>   DW_AT_data_member_location: 52
 <2><37d>: Abbrev Number: 1 (DW_TAG_member)
    <37e>   DW_AT_name        : (indirect string, offset: 0x3d622): CCR2
    <382>   DW_AT_decl_file   : 6
    <383>   DW_AT_decl_line   : 492
    <385>   DW_AT_decl_column : 17
    <386>   DW_AT_type        : <0xc4>
    <38a>   DW_AT_data_member_location: 56
 <2><38b>: Abbrev Number: 1 (DW_TAG_member)
    <38c>   DW_AT_name        : (indirect string, offset: 0x6f7f2): CCR3
    <390>   DW_AT_decl_file   : 6
    <391>   DW_AT_decl_line   : 493
    <393>   DW_AT_decl_column : 17
    <394>   DW_AT_type        : <0xc4>
    <398>   DW_AT_data_member_location: 60
 <2><399>: Abbrev Number: 1 (DW_TAG_member)
    <39a>   DW_AT_name        : (indirect string, offset: 0x7a2c): CCR4
    <39e>   DW_AT_decl_file   : 6
    <39f>   DW_AT_decl_line   : 494
    <3a1>   DW_AT_decl_column : 17
    <3a2>   DW_AT_type        : <0xc4>
    <3a6>   DW_AT_data_member_location: 64
 <2><3a7>: Abbrev Number: 1 (DW_TAG_member)
    <3a8>   DW_AT_name        : (indirect string, offset: 0x432c6): BDTR
    <3ac>   DW_AT_decl_file   : 6
    <3ad>   DW_AT_decl_line   : 495
    <3af>   DW_AT_decl_column : 17
    <3b0>   DW_AT_type        : <0xc4>
    <3b4>   DW_AT_data_member_location: 68
 <2><3b5>: Abbrev Number: 6 (DW_TAG_member)
    <3b6>   DW_AT_name        : DCR
    <3ba>   DW_AT_decl_file   : 6
    <3ba>   DW_AT_decl_line   : 496
    <3bc>   DW_AT_decl_column : 17
    <3bc>   DW_AT_type        : <0xc4>
    <3c0>   DW_AT_data_member_location: 72
 <2><3c1>: Abbrev Number: 1 (DW_TAG_member)
    <3c2>   DW_AT_name        : (indirect string, offset: 0x7cc4b): DMAR
    <3c6>   DW_AT_decl_file   : 6
    <3c7>   DW_AT_decl_line   : 497
    <3c9>   DW_AT_decl_column : 17
    <3ca>   DW_AT_type        : <0xc4>
    <3ce>   DW_AT_data_member_location: 76
 <2><3cf>: Abbrev Number: 6 (DW_TAG_member)
    <3d0>   DW_AT_name        : OR
    <3d3>   DW_AT_decl_file   : 6
    <3d3>   DW_AT_decl_line   : 498
    <3d5>   DW_AT_decl_column : 17
    <3d5>   DW_AT_type        : <0xc4>
    <3d9>   DW_AT_data_member_location: 80
 <2><3da>: Abbrev Number: 0
 <1><3db>: Abbrev Number: 8 (DW_TAG_typedef)
    <3dc>   DW_AT_name        : (indirect string, offset: 0x52a8): TIM_TypeDef
    <3e0>   DW_AT_decl_file   : 6
    <3e1>   DW_AT_decl_line   : 499
    <3e3>   DW_AT_decl_column : 2
    <3e4>   DW_AT_type        : <0x2c1>
 <1><3e8>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <3e9>   DW_AT_encoding    : 7	(unsigned)
    <3e9>   DW_AT_byte_size   : 1
    <3e9>   DW_AT_type        : <0x59>
    <3ed>   DW_AT_decl_file   : 7
    <3ee>   DW_AT_decl_line   : 39
    <3ef>   DW_AT_decl_column : 1
    <3ef>   DW_AT_sibling     : <0x40c>
 <2><3f3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <3f4>   DW_AT_name        : (indirect string, offset: 0x3105a): HAL_OK
    <3f8>   DW_AT_const_value : 0
 <2><3f9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <3fa>   DW_AT_name        : (indirect string, offset: 0x5ae90): HAL_ERROR
    <3fe>   DW_AT_const_value : 1
 <2><3ff>: Abbrev Number: 2 (DW_TAG_enumerator)
    <400>   DW_AT_name        : (indirect string, offset: 0x193f3): HAL_BUSY
    <404>   DW_AT_const_value : 2
 <2><405>: Abbrev Number: 2 (DW_TAG_enumerator)
    <406>   DW_AT_name        : (indirect string, offset: 0x2a9ba): HAL_TIMEOUT
    <40a>   DW_AT_const_value : 3
 <2><40b>: Abbrev Number: 0
 <1><40c>: Abbrev Number: 4 (DW_TAG_typedef)
    <40d>   DW_AT_name        : (indirect string, offset: 0x1c55): HAL_StatusTypeDef
    <411>   DW_AT_decl_file   : 7
    <412>   DW_AT_decl_line   : 44
    <413>   DW_AT_decl_column : 3
    <414>   DW_AT_type        : <0x3e8>
 <1><418>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <419>   DW_AT_encoding    : 7	(unsigned)
    <419>   DW_AT_byte_size   : 1
    <419>   DW_AT_type        : <0x59>
    <41d>   DW_AT_decl_file   : 7
    <41e>   DW_AT_decl_line   : 50
    <41f>   DW_AT_decl_column : 1
    <41f>   DW_AT_sibling     : <0x430>
 <2><423>: Abbrev Number: 2 (DW_TAG_enumerator)
    <424>   DW_AT_name        : (indirect string, offset: 0x6bb61): HAL_UNLOCKED
    <428>   DW_AT_const_value : 0
 <2><429>: Abbrev Number: 2 (DW_TAG_enumerator)
    <42a>   DW_AT_name        : (indirect string, offset: 0x9070c): HAL_LOCKED
    <42e>   DW_AT_const_value : 1
 <2><42f>: Abbrev Number: 0
 <1><430>: Abbrev Number: 4 (DW_TAG_typedef)
    <431>   DW_AT_name        : (indirect string, offset: 0x557b0): HAL_LockTypeDef
    <435>   DW_AT_decl_file   : 7
    <436>   DW_AT_decl_line   : 53
    <437>   DW_AT_decl_column : 3
    <438>   DW_AT_type        : <0x418>
 <1><43c>: Abbrev Number: 18 (DW_TAG_structure_type)
    <43d>   DW_AT_byte_size   : 28
    <43e>   DW_AT_decl_file   : 8
    <43f>   DW_AT_decl_line   : 47
    <440>   DW_AT_decl_column : 9
    <440>   DW_AT_sibling     : <0x4a0>
 <2><444>: Abbrev Number: 3 (DW_TAG_member)
    <445>   DW_AT_name        : (indirect string, offset: 0x9aed0): Direction
    <449>   DW_AT_decl_file   : 8
    <44a>   DW_AT_decl_line   : 49
    <44b>   DW_AT_decl_column : 12
    <44c>   DW_AT_type        : <0xb8>
    <450>   DW_AT_data_member_location: 0
 <2><451>: Abbrev Number: 3 (DW_TAG_member)
    <452>   DW_AT_name        : (indirect string, offset: 0x9dcd): PeriphInc
    <456>   DW_AT_decl_file   : 8
    <457>   DW_AT_decl_line   : 53
    <458>   DW_AT_decl_column : 12
    <459>   DW_AT_type        : <0xb8>
    <45d>   DW_AT_data_member_location: 4
 <2><45e>: Abbrev Number: 3 (DW_TAG_member)
    <45f>   DW_AT_name        : (indirect string, offset: 0x16af4): MemInc
    <463>   DW_AT_decl_file   : 8
    <464>   DW_AT_decl_line   : 56
    <465>   DW_AT_decl_column : 12
    <466>   DW_AT_type        : <0xb8>
    <46a>   DW_AT_data_member_location: 8
 <2><46b>: Abbrev Number: 3 (DW_TAG_member)
    <46c>   DW_AT_name        : (indirect string, offset: 0x48438): PeriphDataAlignment
    <470>   DW_AT_decl_file   : 8
    <471>   DW_AT_decl_line   : 59
    <472>   DW_AT_decl_column : 12
    <473>   DW_AT_type        : <0xb8>
    <477>   DW_AT_data_member_location: 12
 <2><478>: Abbrev Number: 3 (DW_TAG_member)
    <479>   DW_AT_name        : (indirect string, offset: 0x82f59): MemDataAlignment
    <47d>   DW_AT_decl_file   : 8
    <47e>   DW_AT_decl_line   : 62
    <47f>   DW_AT_decl_column : 12
    <480>   DW_AT_type        : <0xb8>
    <484>   DW_AT_data_member_location: 16
 <2><485>: Abbrev Number: 3 (DW_TAG_member)
    <486>   DW_AT_name        : (indirect string, offset: 0x9c045): Mode
    <48a>   DW_AT_decl_file   : 8
    <48b>   DW_AT_decl_line   : 65
    <48c>   DW_AT_decl_column : 12
    <48d>   DW_AT_type        : <0xb8>
    <491>   DW_AT_data_member_location: 20
 <2><492>: Abbrev Number: 3 (DW_TAG_member)
    <493>   DW_AT_name        : (indirect string, offset: 0x99beb): Priority
    <497>   DW_AT_decl_file   : 8
    <498>   DW_AT_decl_line   : 70
    <499>   DW_AT_decl_column : 12
    <49a>   DW_AT_type        : <0xb8>
    <49e>   DW_AT_data_member_location: 24
 <2><49f>: Abbrev Number: 0
 <1><4a0>: Abbrev Number: 4 (DW_TAG_typedef)
    <4a1>   DW_AT_name        : (indirect string, offset: 0x269c8): DMA_InitTypeDef
    <4a5>   DW_AT_decl_file   : 8
    <4a6>   DW_AT_decl_line   : 72
    <4a7>   DW_AT_decl_column : 3
    <4a8>   DW_AT_type        : <0x43c>
 <1><4ac>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <4ad>   DW_AT_encoding    : 7	(unsigned)
    <4ad>   DW_AT_byte_size   : 1
    <4ad>   DW_AT_type        : <0x59>
    <4b1>   DW_AT_decl_file   : 8
    <4b2>   DW_AT_decl_line   : 78
    <4b3>   DW_AT_decl_column : 1
    <4b3>   DW_AT_sibling     : <0x4d0>
 <2><4b7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <4b8>   DW_AT_name        : (indirect string, offset: 0x6cb96): HAL_DMA_STATE_RESET
    <4bc>   DW_AT_const_value : 0
 <2><4bd>: Abbrev Number: 2 (DW_TAG_enumerator)
    <4be>   DW_AT_name        : (indirect string, offset: 0x2793f): HAL_DMA_STATE_READY
    <4c2>   DW_AT_const_value : 1
 <2><4c3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <4c4>   DW_AT_name        : (indirect string, offset: 0x64f7c): HAL_DMA_STATE_BUSY
    <4c8>   DW_AT_const_value : 2
 <2><4c9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <4ca>   DW_AT_name        : (indirect string, offset: 0x8e1f2): HAL_DMA_STATE_TIMEOUT
    <4ce>   DW_AT_const_value : 3
 <2><4cf>: Abbrev Number: 0
 <1><4d0>: Abbrev Number: 4 (DW_TAG_typedef)
    <4d1>   DW_AT_name        : (indirect string, offset: 0x60ee0): HAL_DMA_StateTypeDef
    <4d5>   DW_AT_decl_file   : 8
    <4d6>   DW_AT_decl_line   : 83
    <4d7>   DW_AT_decl_column : 2
    <4d8>   DW_AT_type        : <0x4ac>
 <1><4dc>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <4dd>   DW_AT_type        : <0x4d0>
 <1><4e1>: Abbrev Number: 24 (DW_TAG_structure_type)
    <4e2>   DW_AT_name        : (indirect string, offset: 0x7bc3e): __DMA_HandleTypeDef
    <4e6>   DW_AT_byte_size   : 68
    <4e7>   DW_AT_decl_file   : 8
    <4e8>   DW_AT_decl_line   : 110
    <4e9>   DW_AT_decl_column : 16
    <4ea>   DW_AT_sibling     : <0x58b>
 <2><4ee>: Abbrev Number: 3 (DW_TAG_member)
    <4ef>   DW_AT_name        : (indirect string, offset: 0x38c8d): Instance
    <4f3>   DW_AT_decl_file   : 8
    <4f4>   DW_AT_decl_line   : 112
    <4f5>   DW_AT_decl_column : 31
    <4f6>   DW_AT_type        : <0x58b>
    <4fa>   DW_AT_data_member_location: 0
 <2><4fb>: Abbrev Number: 3 (DW_TAG_member)
    <4fc>   DW_AT_name        : (indirect string, offset: 0x9a3d2): Init
    <500>   DW_AT_decl_file   : 8
    <501>   DW_AT_decl_line   : 114
    <502>   DW_AT_decl_column : 30
    <503>   DW_AT_type        : <0x4a0>
    <507>   DW_AT_data_member_location: 4
 <2><508>: Abbrev Number: 3 (DW_TAG_member)
    <509>   DW_AT_name        : (indirect string, offset: 0x9a0b1): Lock
    <50d>   DW_AT_decl_file   : 8
    <50e>   DW_AT_decl_line   : 116
    <50f>   DW_AT_decl_column : 30
    <510>   DW_AT_type        : <0x430>
    <514>   DW_AT_data_member_location: 32
 <2><515>: Abbrev Number: 3 (DW_TAG_member)
    <516>   DW_AT_name        : (indirect string, offset: 0x96f3a): State
    <51a>   DW_AT_decl_file   : 8
    <51b>   DW_AT_decl_line   : 118
    <51c>   DW_AT_decl_column : 30
    <51d>   DW_AT_type        : <0x4dc>
    <521>   DW_AT_data_member_location: 33
 <2><522>: Abbrev Number: 3 (DW_TAG_member)
    <523>   DW_AT_name        : (indirect string, offset: 0x8976b): Parent
    <527>   DW_AT_decl_file   : 8
    <528>   DW_AT_decl_line   : 120
    <529>   DW_AT_decl_column : 31
    <52a>   DW_AT_type        : <0xc9>
    <52e>   DW_AT_data_member_location: 36
 <2><52f>: Abbrev Number: 3 (DW_TAG_member)
    <530>   DW_AT_name        : (indirect string, offset: 0x8fba1): XferCpltCallback
    <534>   DW_AT_decl_file   : 8
    <535>   DW_AT_decl_line   : 122
    <536>   DW_AT_decl_column : 33
    <537>   DW_AT_type        : <0x5a0>
    <53b>   DW_AT_data_member_location: 40
 <2><53c>: Abbrev Number: 3 (DW_TAG_member)
    <53d>   DW_AT_name        : (indirect string, offset: 0x71323): XferHalfCpltCallback
    <541>   DW_AT_decl_file   : 8
    <542>   DW_AT_decl_line   : 124
    <543>   DW_AT_decl_column : 33
    <544>   DW_AT_type        : <0x5a0>
    <548>   DW_AT_data_member_location: 44
 <2><549>: Abbrev Number: 3 (DW_TAG_member)
    <54a>   DW_AT_name        : (indirect string, offset: 0x14c48): XferErrorCallback
    <54e>   DW_AT_decl_file   : 8
    <54f>   DW_AT_decl_line   : 126
    <550>   DW_AT_decl_column : 33
    <551>   DW_AT_type        : <0x5a0>
    <555>   DW_AT_data_member_location: 48
 <2><556>: Abbrev Number: 3 (DW_TAG_member)
    <557>   DW_AT_name        : (indirect string, offset: 0x86f16): XferAbortCallback
    <55b>   DW_AT_decl_file   : 8
    <55c>   DW_AT_decl_line   : 128
    <55d>   DW_AT_decl_column : 33
    <55e>   DW_AT_type        : <0x5a0>
    <562>   DW_AT_data_member_location: 52
 <2><563>: Abbrev Number: 3 (DW_TAG_member)
    <564>   DW_AT_name        : (indirect string, offset: 0x99f49): ErrorCode
    <568>   DW_AT_decl_file   : 8
    <569>   DW_AT_decl_line   : 130
    <56a>   DW_AT_decl_column : 30
    <56b>   DW_AT_type        : <0xc4>
    <56f>   DW_AT_data_member_location: 56
 <2><570>: Abbrev Number: 3 (DW_TAG_member)
    <571>   DW_AT_name        : (indirect string, offset: 0x3e4ba): DmaBaseAddress
    <575>   DW_AT_decl_file   : 8
    <576>   DW_AT_decl_line   : 132
    <577>   DW_AT_decl_column : 31
    <578>   DW_AT_type        : <0x5a5>
    <57c>   DW_AT_data_member_location: 60
 <2><57d>: Abbrev Number: 3 (DW_TAG_member)
    <57e>   DW_AT_name        : (indirect string, offset: 0x1de7b): ChannelIndex
    <582>   DW_AT_decl_file   : 8
    <583>   DW_AT_decl_line   : 134
    <584>   DW_AT_decl_column : 30
    <585>   DW_AT_type        : <0xb8>
    <589>   DW_AT_data_member_location: 64
 <2><58a>: Abbrev Number: 0
 <1><58b>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <58c>   DW_AT_byte_size   : 4
    <58c>   DW_AT_type        : <0x283>
 <1><590>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <591>   DW_AT_prototyped  : 1
    <591>   DW_AT_sibling     : <0x59b>
 <2><595>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <596>   DW_AT_type        : <0x59b>
 <2><59a>: Abbrev Number: 0
 <1><59b>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <59c>   DW_AT_byte_size   : 4
    <59c>   DW_AT_type        : <0x4e1>
 <1><5a0>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <5a1>   DW_AT_byte_size   : 4
    <5a1>   DW_AT_type        : <0x590>
 <1><5a5>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <5a6>   DW_AT_byte_size   : 4
    <5a6>   DW_AT_type        : <0x2b4>
 <1><5aa>: Abbrev Number: 4 (DW_TAG_typedef)
    <5ab>   DW_AT_name        : (indirect string, offset: 0x7bc40): DMA_HandleTypeDef
    <5af>   DW_AT_decl_file   : 8
    <5b0>   DW_AT_decl_line   : 136
    <5b1>   DW_AT_decl_column : 3
    <5b2>   DW_AT_type        : <0x4e1>
 <1><5b6>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <5b7>   DW_AT_byte_size   : 4
    <5b7>   DW_AT_type        : <0x5aa>
 <1><5bb>: Abbrev Number: 18 (DW_TAG_structure_type)
    <5bc>   DW_AT_byte_size   : 24
    <5bd>   DW_AT_decl_file   : 9
    <5be>   DW_AT_decl_line   : 46
    <5bf>   DW_AT_decl_column : 9
    <5bf>   DW_AT_sibling     : <0x612>
 <2><5c3>: Abbrev Number: 3 (DW_TAG_member)
    <5c4>   DW_AT_name        : (indirect string, offset: 0x9c157): Prescaler
    <5c8>   DW_AT_decl_file   : 9
    <5c9>   DW_AT_decl_line   : 48
    <5ca>   DW_AT_decl_column : 12
    <5cb>   DW_AT_type        : <0xb8>
    <5cf>   DW_AT_data_member_location: 0
 <2><5d0>: Abbrev Number: 3 (DW_TAG_member)
    <5d1>   DW_AT_name        : (indirect string, offset: 0x83831): CounterMode
    <5d5>   DW_AT_decl_file   : 9
    <5d6>   DW_AT_decl_line   : 51
    <5d7>   DW_AT_decl_column : 12
    <5d8>   DW_AT_type        : <0xb8>
    <5dc>   DW_AT_data_member_location: 4
 <2><5dd>: Abbrev Number: 3 (DW_TAG_member)
    <5de>   DW_AT_name        : (indirect string, offset: 0x9f84a): Period
    <5e2>   DW_AT_decl_file   : 9
    <5e3>   DW_AT_decl_line   : 54
    <5e4>   DW_AT_decl_column : 12
    <5e5>   DW_AT_type        : <0xb8>
    <5e9>   DW_AT_data_member_location: 8
 <2><5ea>: Abbrev Number: 3 (DW_TAG_member)
    <5eb>   DW_AT_name        : (indirect string, offset: 0x3b4ba): ClockDivision
    <5ef>   DW_AT_decl_file   : 9
    <5f0>   DW_AT_decl_line   : 58
    <5f1>   DW_AT_decl_column : 12
    <5f2>   DW_AT_type        : <0xb8>
    <5f6>   DW_AT_data_member_location: 12
 <2><5f7>: Abbrev Number: 3 (DW_TAG_member)
    <5f8>   DW_AT_name        : (indirect string, offset: 0x661b7): RepetitionCounter
    <5fc>   DW_AT_decl_file   : 9
    <5fd>   DW_AT_decl_line   : 61
    <5fe>   DW_AT_decl_column : 12
    <5ff>   DW_AT_type        : <0xb8>
    <603>   DW_AT_data_member_location: 16
 <2><604>: Abbrev Number: 3 (DW_TAG_member)
    <605>   DW_AT_name        : (indirect string, offset: 0xea71): AutoReloadPreload
    <609>   DW_AT_decl_file   : 9
    <60a>   DW_AT_decl_line   : 72
    <60b>   DW_AT_decl_column : 12
    <60c>   DW_AT_type        : <0xb8>
    <610>   DW_AT_data_member_location: 20
 <2><611>: Abbrev Number: 0
 <1><612>: Abbrev Number: 4 (DW_TAG_typedef)
    <613>   DW_AT_name        : (indirect string, offset: 0x81e63): TIM_Base_InitTypeDef
    <617>   DW_AT_decl_file   : 9
    <618>   DW_AT_decl_line   : 74
    <619>   DW_AT_decl_column : 3
    <61a>   DW_AT_type        : <0x5bb>
 <1><61e>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <61f>   DW_AT_encoding    : 7	(unsigned)
    <61f>   DW_AT_byte_size   : 1
    <61f>   DW_AT_type        : <0x59>
    <623>   DW_AT_decl_file   : 9
    <623>   DW_AT_decl_line   : 291
    <625>   DW_AT_decl_column : 1
    <625>   DW_AT_sibling     : <0x648>
 <2><629>: Abbrev Number: 2 (DW_TAG_enumerator)
    <62a>   DW_AT_name        : (indirect string, offset: 0x4935e): HAL_TIM_STATE_RESET
    <62e>   DW_AT_const_value : 0
 <2><62f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <630>   DW_AT_name        : (indirect string, offset: 0x5619): HAL_TIM_STATE_READY
    <634>   DW_AT_const_value : 1
 <2><635>: Abbrev Number: 2 (DW_TAG_enumerator)
    <636>   DW_AT_name        : (indirect string, offset: 0x2433b): HAL_TIM_STATE_BUSY
    <63a>   DW_AT_const_value : 2
 <2><63b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <63c>   DW_AT_name        : (indirect string, offset: 0x79a8e): HAL_TIM_STATE_TIMEOUT
    <640>   DW_AT_const_value : 3
 <2><641>: Abbrev Number: 2 (DW_TAG_enumerator)
    <642>   DW_AT_name        : (indirect string, offset: 0x35446): HAL_TIM_STATE_ERROR
    <646>   DW_AT_const_value : 4
 <2><647>: Abbrev Number: 0
 <1><648>: Abbrev Number: 8 (DW_TAG_typedef)
    <649>   DW_AT_name        : (indirect string, offset: 0x69a40): HAL_TIM_StateTypeDef
    <64d>   DW_AT_decl_file   : 9
    <64e>   DW_AT_decl_line   : 297
    <650>   DW_AT_decl_column : 3
    <651>   DW_AT_type        : <0x61e>
 <1><655>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <656>   DW_AT_type        : <0x648>
 <1><65a>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <65b>   DW_AT_encoding    : 7	(unsigned)
    <65b>   DW_AT_byte_size   : 1
    <65b>   DW_AT_type        : <0x59>
    <65f>   DW_AT_decl_file   : 9
    <65f>   DW_AT_decl_line   : 303
    <661>   DW_AT_decl_column : 1
    <661>   DW_AT_sibling     : <0x678>
 <2><665>: Abbrev Number: 2 (DW_TAG_enumerator)
    <666>   DW_AT_name        : (indirect string, offset: 0x33bf3): HAL_TIM_CHANNEL_STATE_RESET
    <66a>   DW_AT_const_value : 0
 <2><66b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <66c>   DW_AT_name        : (indirect string, offset: 0x55315): HAL_TIM_CHANNEL_STATE_READY
    <670>   DW_AT_const_value : 1
 <2><671>: Abbrev Number: 2 (DW_TAG_enumerator)
    <672>   DW_AT_name        : (indirect string, offset: 0x4613e): HAL_TIM_CHANNEL_STATE_BUSY
    <676>   DW_AT_const_value : 2
 <2><677>: Abbrev Number: 0
 <1><678>: Abbrev Number: 8 (DW_TAG_typedef)
    <679>   DW_AT_name        : (indirect string, offset: 0x1e46f): HAL_TIM_ChannelStateTypeDef
    <67d>   DW_AT_decl_file   : 9
    <67e>   DW_AT_decl_line   : 307
    <680>   DW_AT_decl_column : 3
    <681>   DW_AT_type        : <0x65a>
 <1><685>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <686>   DW_AT_type        : <0x678>
 <1><68a>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <68b>   DW_AT_encoding    : 7	(unsigned)
    <68b>   DW_AT_byte_size   : 1
    <68b>   DW_AT_type        : <0x59>
    <68f>   DW_AT_decl_file   : 9
    <68f>   DW_AT_decl_line   : 313
    <691>   DW_AT_decl_column : 1
    <691>   DW_AT_sibling     : <0x6a8>
 <2><695>: Abbrev Number: 2 (DW_TAG_enumerator)
    <696>   DW_AT_name        : (indirect string, offset: 0x2f85): HAL_DMA_BURST_STATE_RESET
    <69a>   DW_AT_const_value : 0
 <2><69b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <69c>   DW_AT_name        : (indirect string, offset: 0x4fe56): HAL_DMA_BURST_STATE_READY
    <6a0>   DW_AT_const_value : 1
 <2><6a1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6a2>   DW_AT_name        : (indirect string, offset: 0x6d58a): HAL_DMA_BURST_STATE_BUSY
    <6a6>   DW_AT_const_value : 2
 <2><6a7>: Abbrev Number: 0
 <1><6a8>: Abbrev Number: 8 (DW_TAG_typedef)
    <6a9>   DW_AT_name        : (indirect string, offset: 0x1384b): HAL_TIM_DMABurstStateTypeDef
    <6ad>   DW_AT_decl_file   : 9
    <6ae>   DW_AT_decl_line   : 317
    <6b0>   DW_AT_decl_column : 3
    <6b1>   DW_AT_type        : <0x68a>
 <1><6b5>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <6b6>   DW_AT_type        : <0x6a8>
 <1><6ba>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <6bb>   DW_AT_encoding    : 7	(unsigned)
    <6bb>   DW_AT_byte_size   : 1
    <6bb>   DW_AT_type        : <0x59>
    <6bf>   DW_AT_decl_file   : 9
    <6bf>   DW_AT_decl_line   : 323
    <6c1>   DW_AT_decl_column : 1
    <6c1>   DW_AT_sibling     : <0x6e4>
 <2><6c5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6c6>   DW_AT_name        : (indirect string, offset: 0x51649): HAL_TIM_ACTIVE_CHANNEL_1
    <6ca>   DW_AT_const_value : 1
 <2><6cb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6cc>   DW_AT_name        : (indirect string, offset: 0x51662): HAL_TIM_ACTIVE_CHANNEL_2
    <6d0>   DW_AT_const_value : 2
 <2><6d1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6d2>   DW_AT_name        : (indirect string, offset: 0x5167b): HAL_TIM_ACTIVE_CHANNEL_3
    <6d6>   DW_AT_const_value : 4
 <2><6d7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6d8>   DW_AT_name        : (indirect string, offset: 0x51694): HAL_TIM_ACTIVE_CHANNEL_4
    <6dc>   DW_AT_const_value : 8
 <2><6dd>: Abbrev Number: 2 (DW_TAG_enumerator)
    <6de>   DW_AT_name        : (indirect string, offset: 0x3c1b9): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <6e2>   DW_AT_const_value : 0
 <2><6e3>: Abbrev Number: 0
 <1><6e4>: Abbrev Number: 8 (DW_TAG_typedef)
    <6e5>   DW_AT_name        : (indirect string, offset: 0x1d3fa): HAL_TIM_ActiveChannel
    <6e9>   DW_AT_decl_file   : 9
    <6ea>   DW_AT_decl_line   : 329
    <6ec>   DW_AT_decl_column : 3
    <6ed>   DW_AT_type        : <0x6ba>
 <1><6f1>: Abbrev Number: 13 (DW_TAG_structure_type)
    <6f2>   DW_AT_byte_size   : 72
    <6f3>   DW_AT_decl_file   : 9
    <6f4>   DW_AT_decl_line   : 337
    <6f6>   DW_AT_decl_column : 9
    <6f6>   DW_AT_sibling     : <0x779>
 <2><6fa>: Abbrev Number: 1 (DW_TAG_member)
    <6fb>   DW_AT_name        : (indirect string, offset: 0x38c8d): Instance
    <6ff>   DW_AT_decl_file   : 9
    <700>   DW_AT_decl_line   : 340
    <702>   DW_AT_decl_column : 39
    <703>   DW_AT_type        : <0x779>
    <707>   DW_AT_data_member_location: 0
 <2><708>: Abbrev Number: 1 (DW_TAG_member)
    <709>   DW_AT_name        : (indirect string, offset: 0x9a3d2): Init
    <70d>   DW_AT_decl_file   : 9
    <70e>   DW_AT_decl_line   : 341
    <710>   DW_AT_decl_column : 38
    <711>   DW_AT_type        : <0x612>
    <715>   DW_AT_data_member_location: 4
 <2><716>: Abbrev Number: 1 (DW_TAG_member)
    <717>   DW_AT_name        : (indirect string, offset: 0x992f8): Channel
    <71b>   DW_AT_decl_file   : 9
    <71c>   DW_AT_decl_line   : 342
    <71e>   DW_AT_decl_column : 38
    <71f>   DW_AT_type        : <0x6e4>
    <723>   DW_AT_data_member_location: 28
 <2><724>: Abbrev Number: 1 (DW_TAG_member)
    <725>   DW_AT_name        : (indirect string, offset: 0x573e1): hdma
    <729>   DW_AT_decl_file   : 9
    <72a>   DW_AT_decl_line   : 343
    <72c>   DW_AT_decl_column : 39
    <72d>   DW_AT_type        : <0x77e>
    <731>   DW_AT_data_member_location: 32
 <2><732>: Abbrev Number: 1 (DW_TAG_member)
    <733>   DW_AT_name        : (indirect string, offset: 0x9a0b1): Lock
    <737>   DW_AT_decl_file   : 9
    <738>   DW_AT_decl_line   : 345
    <73a>   DW_AT_decl_column : 38
    <73b>   DW_AT_type        : <0x430>
    <73f>   DW_AT_data_member_location: 60
 <2><740>: Abbrev Number: 1 (DW_TAG_member)
    <741>   DW_AT_name        : (indirect string, offset: 0x96f3a): State
    <745>   DW_AT_decl_file   : 9
    <746>   DW_AT_decl_line   : 346
    <748>   DW_AT_decl_column : 38
    <749>   DW_AT_type        : <0x655>
    <74d>   DW_AT_data_member_location: 61
 <2><74e>: Abbrev Number: 1 (DW_TAG_member)
    <74f>   DW_AT_name        : (indirect string, offset: 0x9c689): ChannelState
    <753>   DW_AT_decl_file   : 9
    <754>   DW_AT_decl_line   : 347
    <756>   DW_AT_decl_column : 38
    <757>   DW_AT_type        : <0x79e>
    <75b>   DW_AT_data_member_location: 62
 <2><75c>: Abbrev Number: 1 (DW_TAG_member)
    <75d>   DW_AT_name        : (indirect string, offset: 0x9cc14): ChannelNState
    <761>   DW_AT_decl_file   : 9
    <762>   DW_AT_decl_line   : 348
    <764>   DW_AT_decl_column : 38
    <765>   DW_AT_type        : <0x79e>
    <769>   DW_AT_data_member_location: 66
 <2><76a>: Abbrev Number: 1 (DW_TAG_member)
    <76b>   DW_AT_name        : (indirect string, offset: 0x9c215): DMABurstState
    <76f>   DW_AT_decl_file   : 9
    <770>   DW_AT_decl_line   : 349
    <772>   DW_AT_decl_column : 38
    <773>   DW_AT_type        : <0x6b5>
    <777>   DW_AT_data_member_location: 70
 <2><778>: Abbrev Number: 0
 <1><779>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <77a>   DW_AT_byte_size   : 4
    <77a>   DW_AT_type        : <0x3db>
 <1><77e>: Abbrev Number: 9 (DW_TAG_array_type)
    <77f>   DW_AT_type        : <0x5b6>
    <783>   DW_AT_sibling     : <0x78e>
 <2><787>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <788>   DW_AT_type        : <0x31>
    <78c>   DW_AT_upper_bound : 6
 <2><78d>: Abbrev Number: 0
 <1><78e>: Abbrev Number: 9 (DW_TAG_array_type)
    <78f>   DW_AT_type        : <0x685>
    <793>   DW_AT_sibling     : <0x79e>
 <2><797>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <798>   DW_AT_type        : <0x31>
    <79c>   DW_AT_upper_bound : 3
 <2><79d>: Abbrev Number: 0
 <1><79e>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <79f>   DW_AT_type        : <0x78e>
 <1><7a3>: Abbrev Number: 8 (DW_TAG_typedef)
    <7a4>   DW_AT_name        : (indirect string, offset: 0x31e17): TIM_HandleTypeDef
    <7a8>   DW_AT_decl_file   : 9
    <7a9>   DW_AT_decl_line   : 380
    <7ab>   DW_AT_decl_column : 3
    <7ac>   DW_AT_type        : <0x6f1>
 <1><7b0>: Abbrev Number: 26 (DW_TAG_variable)
    <7b1>   DW_AT_name        : (indirect string, offset: 0x71c05): ulStatsTimerTicks
    <7b5>   DW_AT_decl_file   : 1
    <7b6>   DW_AT_decl_line   : 47
    <7b7>   DW_AT_decl_column : 24
    <7b8>   DW_AT_type        : <0x94>
    <7bc>   DW_AT_external    : 1
    <7bc>   DW_AT_location    : 5 byte block: 3 2c 0 0 20 	(DW_OP_addr: 2000002c)
 <1><7c2>: Abbrev Number: 27 (DW_TAG_variable)
    <7c3>   DW_AT_name        : (indirect string, offset: 0x58874): htim2
    <7c7>   DW_AT_decl_file   : 1
    <7c8>   DW_AT_decl_line   : 48
    <7c9>   DW_AT_decl_column : 26
    <7ca>   DW_AT_type        : <0x7a3>
    <7ce>   DW_AT_external    : 1
    <7ce>   DW_AT_declaration : 1
 <1><7ce>: Abbrev Number: 15 (DW_TAG_variable)
    <7cf>   DW_AT_name        : (indirect string, offset: 0x4cb19): xIdleTaskTCBBuffer
    <7d3>   DW_AT_decl_file   : 1
    <7d3>   DW_AT_decl_line   : 81
    <7d4>   DW_AT_decl_column : 21
    <7d5>   DW_AT_type        : <0x22a>
    <7d9>   DW_AT_location    : 5 byte block: 3 30 0 0 20 	(DW_OP_addr: 20000030)
 <1><7df>: Abbrev Number: 9 (DW_TAG_array_type)
    <7e0>   DW_AT_type        : <0xcb>
    <7e4>   DW_AT_sibling     : <0x7ef>
 <2><7e8>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <7e9>   DW_AT_type        : <0x31>
    <7ed>   DW_AT_upper_bound : 127
 <2><7ee>: Abbrev Number: 0
 <1><7ef>: Abbrev Number: 15 (DW_TAG_variable)
    <7f0>   DW_AT_name        : (indirect string, offset: 0x36989): xIdleStack
    <7f4>   DW_AT_decl_file   : 1
    <7f4>   DW_AT_decl_line   : 82
    <7f5>   DW_AT_decl_column : 20
    <7f6>   DW_AT_type        : <0x7df>
    <7fa>   DW_AT_location    : 5 byte block: 3 98 0 0 20 	(DW_OP_addr: 20000098)
 <1><800>: Abbrev Number: 15 (DW_TAG_variable)
    <801>   DW_AT_name        : (indirect string, offset: 0x75855): xTimerTaskTCBBuffer
    <805>   DW_AT_decl_file   : 1
    <805>   DW_AT_decl_line   : 94
    <806>   DW_AT_decl_column : 21
    <807>   DW_AT_type        : <0x22a>
    <80b>   DW_AT_location    : 5 byte block: 3 98 2 0 20 	(DW_OP_addr: 20000298)
 <1><811>: Abbrev Number: 9 (DW_TAG_array_type)
    <812>   DW_AT_type        : <0xcb>
    <816>   DW_AT_sibling     : <0x821>
 <2><81a>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <81b>   DW_AT_type        : <0x31>
    <81f>   DW_AT_upper_bound : 255
 <2><820>: Abbrev Number: 0
 <1><821>: Abbrev Number: 15 (DW_TAG_variable)
    <822>   DW_AT_name        : (indirect string, offset: 0x7f1e6): xTimerStack
    <826>   DW_AT_decl_file   : 1
    <826>   DW_AT_decl_line   : 95
    <827>   DW_AT_decl_column : 20
    <828>   DW_AT_type        : <0x811>
    <82c>   DW_AT_location    : 5 byte block: 3 0 3 0 20 	(DW_OP_addr: 20000300)
 <1><832>: Abbrev Number: 28 (DW_TAG_subprogram)
    <833>   DW_AT_external    : 1
    <833>   DW_AT_name        : (indirect string, offset: 0x3e268): HAL_TIM_Base_Start_IT
    <837>   DW_AT_decl_file   : 9
    <838>   DW_AT_decl_line   : 1896
    <83a>   DW_AT_decl_column : 19
    <83b>   DW_AT_prototyped  : 1
    <83b>   DW_AT_type        : <0x40c>
    <83f>   DW_AT_declaration : 1
    <83f>   DW_AT_sibling     : <0x849>
 <2><843>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <844>   DW_AT_type        : <0x849>
 <2><848>: Abbrev Number: 0
 <1><849>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <84a>   DW_AT_byte_size   : 4
    <84a>   DW_AT_type        : <0x7a3>
 <1><84e>: Abbrev Number: 20 (DW_TAG_subprogram)
    <84f>   DW_AT_external    : 1
    <84f>   DW_AT_name        : (indirect string, offset: 0x774e0): vApplicationGetTimerTaskMemory
    <853>   DW_AT_decl_file   : 1
    <853>   DW_AT_decl_line   : 97
    <854>   DW_AT_decl_column : 6
    <854>   DW_AT_prototyped  : 1
    <854>   DW_AT_low_pc      : 0x80001b0
    <858>   DW_AT_high_pc     : 0x34
    <85c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <85e>   DW_AT_call_all_calls: 1
    <85e>   DW_AT_sibling     : <0x88d>
 <2><862>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <863>   DW_AT_name        : (indirect string, offset: 0x75853): ppxTimerTaskTCBBuffer
    <867>   DW_AT_decl_file   : 1
    <867>   DW_AT_decl_line   : 97
    <868>   DW_AT_decl_column : 53
    <869>   DW_AT_type        : <0x88d>
    <86d>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><870>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <871>   DW_AT_name        : (indirect string, offset: 0x17951): ppxTimerTaskStackBuffer
    <875>   DW_AT_decl_file   : 1
    <875>   DW_AT_decl_line   : 97
    <876>   DW_AT_decl_column : 90
    <877>   DW_AT_type        : <0x897>
    <87b>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><87e>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <87f>   DW_AT_name        : (indirect string, offset: 0x4d4bd): pulTimerTaskStackSize
    <883>   DW_AT_decl_file   : 1
    <883>   DW_AT_decl_line   : 97
    <884>   DW_AT_decl_column : 125
    <885>   DW_AT_type        : <0x89c>
    <889>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><88c>: Abbrev Number: 0
 <1><88d>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <88e>   DW_AT_byte_size   : 4
    <88e>   DW_AT_type        : <0x892>
 <1><892>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <893>   DW_AT_byte_size   : 4
    <893>   DW_AT_type        : <0x22a>
 <1><897>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <898>   DW_AT_byte_size   : 4
    <898>   DW_AT_type        : <0x23e>
 <1><89c>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <89d>   DW_AT_byte_size   : 4
    <89d>   DW_AT_type        : <0xb8>
 <1><8a1>: Abbrev Number: 20 (DW_TAG_subprogram)
    <8a2>   DW_AT_external    : 1
    <8a2>   DW_AT_name        : (indirect string, offset: 0x8d5d3): vApplicationGetIdleTaskMemory
    <8a6>   DW_AT_decl_file   : 1
    <8a6>   DW_AT_decl_line   : 84
    <8a7>   DW_AT_decl_column : 6
    <8a7>   DW_AT_prototyped  : 1
    <8a7>   DW_AT_low_pc      : 0x8000180
    <8ab>   DW_AT_high_pc     : 0x30
    <8af>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8b1>   DW_AT_call_all_calls: 1
    <8b1>   DW_AT_sibling     : <0x8e0>
 <2><8b5>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <8b6>   DW_AT_name        : (indirect string, offset: 0x4cb17): ppxIdleTaskTCBBuffer
    <8ba>   DW_AT_decl_file   : 1
    <8ba>   DW_AT_decl_line   : 84
    <8bb>   DW_AT_decl_column : 52
    <8bc>   DW_AT_type        : <0x88d>
    <8c0>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><8c3>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <8c4>   DW_AT_name        : (indirect string, offset: 0x53a87): ppxIdleTaskStackBuffer
    <8c8>   DW_AT_decl_file   : 1
    <8c8>   DW_AT_decl_line   : 84
    <8c9>   DW_AT_decl_column : 88
    <8ca>   DW_AT_type        : <0x897>
    <8ce>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><8d1>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <8d2>   DW_AT_name        : (indirect string, offset: 0x4f52f): pulIdleTaskStackSize
    <8d6>   DW_AT_decl_file   : 1
    <8d6>   DW_AT_decl_line   : 84
    <8d7>   DW_AT_decl_column : 122
    <8d8>   DW_AT_type        : <0x89c>
    <8dc>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><8df>: Abbrev Number: 0
 <1><8e0>: Abbrev Number: 29 (DW_TAG_subprogram)
    <8e1>   DW_AT_external    : 1
    <8e1>   DW_AT_name        : (indirect string, offset: 0x42634): getRunTimeCounterValue
    <8e5>   DW_AT_decl_file   : 1
    <8e6>   DW_AT_decl_line   : 74
    <8e7>   DW_AT_decl_column : 22
    <8e8>   DW_AT_prototyped  : 1
    <8e8>   DW_AT_type        : <0x8d>
    <8ec>   DW_AT_low_pc      : 0x800016c
    <8f0>   DW_AT_high_pc     : 0x14
    <8f4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8f6>   DW_AT_call_all_calls: 1
 <1><8f6>: Abbrev Number: 30 (DW_TAG_subprogram)
    <8f7>   DW_AT_external    : 1
    <8f7>   DW_AT_name        : (indirect string, offset: 0x1e3ca): configureTimerForRunTimeStats
    <8fb>   DW_AT_decl_file   : 1
    <8fc>   DW_AT_decl_line   : 68
    <8fd>   DW_AT_decl_column : 13
    <8fe>   DW_AT_prototyped  : 1
    <8fe>   DW_AT_low_pc      : 0x8000150
    <902>   DW_AT_high_pc     : 0x1c
    <906>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <908>   DW_AT_call_all_tail_calls: 1
 <1><908>: Abbrev Number: 0
  Compilation Unit @ offset 0x909:
   Length:        0x387 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x1e4
   Pointer Size:  4
 <0><915>: Abbrev Number: 10 (DW_TAG_compile_unit)
    <916>   DW_AT_producer    : (indirect string, offset: 0x1cf91): GNU C11 12.3.1 20230626 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <91a>   DW_AT_language    : 29	(C11)
    <91b>   DW_AT_name        : (indirect string, offset: 0x9130c): ../Core/Src/handler_adc.c
    <91f>   DW_AT_comp_dir    : (indirect string, offset: 0x877e4): E:/Mcnex/IR_Fillter/IR_Fillter_RTOS/Debug
    <923>   DW_AT_ranges      : 0x31
    <927>   DW_AT_low_pc      : 0
    <92b>   DW_AT_stmt_list   : 0x8da
    <92f>   DW_AT_macros      : 0x173ae
 <1><933>: Abbrev Number: 3 (DW_TAG_base_type)
    <934>   DW_AT_byte_size   : 1
    <935>   DW_AT_encoding    : 6	(signed char)
    <936>   DW_AT_name        : (indirect string, offset: 0x48c28): signed char
 <1><93a>: Abbrev Number: 6 (DW_TAG_typedef)
    <93b>   DW_AT_name        : (indirect string, offset: 0x2a488): __uint8_t
    <93f>   DW_AT_decl_file   : 2
    <940>   DW_AT_decl_line   : 43
    <941>   DW_AT_decl_column : 24
    <942>   DW_AT_type        : <0x946>
 <1><946>: Abbrev Number: 3 (DW_TAG_base_type)
    <947>   DW_AT_byte_size   : 1
    <948>   DW_AT_encoding    : 8	(unsigned char)
    <949>   DW_AT_name        : (indirect string, offset: 0x1d5fa): unsigned char
 <1><94d>: Abbrev Number: 3 (DW_TAG_base_type)
    <94e>   DW_AT_byte_size   : 2
    <94f>   DW_AT_encoding    : 5	(signed)
    <950>   DW_AT_name        : (indirect string, offset: 0x6c8cd): short int
 <1><954>: Abbrev Number: 6 (DW_TAG_typedef)
    <955>   DW_AT_name        : (indirect string, offset: 0x76cfb): __uint16_t
    <959>   DW_AT_decl_file   : 2
    <95a>   DW_AT_decl_line   : 57
    <95b>   DW_AT_decl_column : 25
    <95c>   DW_AT_type        : <0x960>
 <1><960>: Abbrev Number: 3 (DW_TAG_base_type)
    <961>   DW_AT_byte_size   : 2
    <962>   DW_AT_encoding    : 7	(unsigned)
    <963>   DW_AT_name        : (indirect string, offset: 0x2f8e4): short unsigned int
 <1><967>: Abbrev Number: 3 (DW_TAG_base_type)
    <968>   DW_AT_byte_size   : 4
    <969>   DW_AT_encoding    : 5	(signed)
    <96a>   DW_AT_name        : (indirect string, offset: 0xc9a3): long int
 <1><96e>: Abbrev Number: 6 (DW_TAG_typedef)
    <96f>   DW_AT_name        : (indirect string, offset: 0x5c7c7): __uint32_t
    <973>   DW_AT_decl_file   : 2
    <974>   DW_AT_decl_line   : 79
    <975>   DW_AT_decl_column : 25
    <976>   DW_AT_type        : <0x97a>
 <1><97a>: Abbrev Number: 3 (DW_TAG_base_type)
    <97b>   DW_AT_byte_size   : 4
    <97c>   DW_AT_encoding    : 7	(unsigned)
    <97d>   DW_AT_name        : (indirect string, offset: 0x21fab): long unsigned int
 <1><981>: Abbrev Number: 3 (DW_TAG_base_type)
    <982>   DW_AT_byte_size   : 8
    <983>   DW_AT_encoding    : 5	(signed)
    <984>   DW_AT_name        : (indirect string, offset: 0x42985): long long int
 <1><988>: Abbrev Number: 3 (DW_TAG_base_type)
    <989>   DW_AT_byte_size   : 8
    <98a>   DW_AT_encoding    : 7	(unsigned)
    <98b>   DW_AT_name        : (indirect string, offset: 0x1e0bb): long long unsigned int
 <1><98f>: Abbrev Number: 11 (DW_TAG_base_type)
    <990>   DW_AT_byte_size   : 4
    <991>   DW_AT_encoding    : 5	(signed)
    <992>   DW_AT_name        : int
 <1><996>: Abbrev Number: 3 (DW_TAG_base_type)
    <997>   DW_AT_byte_size   : 4
    <998>   DW_AT_encoding    : 7	(unsigned)
    <999>   DW_AT_name        : (indirect string, offset: 0xc2e5): unsigned int
 <1><99d>: Abbrev Number: 6 (DW_TAG_typedef)
    <99e>   DW_AT_name        : (indirect string, offset: 0x2a48a): uint8_t
    <9a2>   DW_AT_decl_file   : 3
    <9a3>   DW_AT_decl_line   : 24
    <9a4>   DW_AT_decl_column : 19
    <9a5>   DW_AT_type        : <0x93a>
 <1><9a9>: Abbrev Number: 6 (DW_TAG_typedef)
    <9aa>   DW_AT_name        : (indirect string, offset: 0x6a5c0): uint16_t
    <9ae>   DW_AT_decl_file   : 3
    <9af>   DW_AT_decl_line   : 36
    <9b0>   DW_AT_decl_column : 20
    <9b1>   DW_AT_type        : <0x954>
 <1><9b5>: Abbrev Number: 6 (DW_TAG_typedef)
    <9b6>   DW_AT_name        : (indirect string, offset: 0x69eda): uint32_t
    <9ba>   DW_AT_decl_file   : 3
    <9bb>   DW_AT_decl_line   : 48
    <9bc>   DW_AT_decl_column : 20
    <9bd>   DW_AT_type        : <0x96e>
 <1><9c1>: Abbrev Number: 8 (DW_TAG_subprogram)
    <9c2>   DW_AT_external    : 1
    <9c2>   DW_AT_name        : (indirect string, offset: 0x913f7): MedianAverage
    <9c6>   DW_AT_decl_file   : 1
    <9c6>   DW_AT_decl_line   : 76
    <9c7>   DW_AT_decl_column : 10
    <9c8>   DW_AT_prototyped  : 1
    <9c8>   DW_AT_type        : <0x9a9>
    <9cc>   DW_AT_low_pc      : 0x80001e4
    <9d0>   DW_AT_high_pc     : 0x12c
    <9d4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9d6>   DW_AT_call_all_calls: 1
    <9d6>   DW_AT_sibling     : <0xa89>
 <2><9da>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <9db>   DW_AT_name        : (indirect string, offset: 0x9138f): adc_array
    <9df>   DW_AT_decl_file   : 1
    <9df>   DW_AT_decl_line   : 76
    <9e0>   DW_AT_decl_column : 34
    <9e1>   DW_AT_type        : <0xa89>
    <9e5>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><9e8>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <9e9>   DW_AT_name        : (indirect string, offset: 0x93e45): size
    <9ed>   DW_AT_decl_file   : 1
    <9ed>   DW_AT_decl_line   : 76
    <9ee>   DW_AT_decl_column : 53
    <9ef>   DW_AT_type        : <0x99d>
    <9f3>   DW_AT_location    : 2 byte block: 91 5b 	(DW_OP_fbreg: -37)
 <2><9f6>: Abbrev Number: 1 (DW_TAG_variable)
    <9f7>   DW_AT_name        : min
    <9fb>   DW_AT_decl_file   : 1
    <9fb>   DW_AT_decl_line   : 81
    <9fc>   DW_AT_decl_column : 14
    <9fd>   DW_AT_type        : <0x9a9>
    <a01>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><a04>: Abbrev Number: 1 (DW_TAG_variable)
    <a05>   DW_AT_name        : max
    <a09>   DW_AT_decl_file   : 1
    <a09>   DW_AT_decl_line   : 82
    <a0a>   DW_AT_decl_column : 14
    <a0b>   DW_AT_type        : <0x9a9>
    <a0f>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><a12>: Abbrev Number: 4 (DW_TAG_variable)
    <a13>   DW_AT_name        : (indirect string, offset: 0x91341): median
    <a17>   DW_AT_decl_file   : 1
    <a17>   DW_AT_decl_line   : 90
    <a18>   DW_AT_decl_column : 14
    <a19>   DW_AT_type        : <0x9a9>
    <a1d>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><a20>: Abbrev Number: 4 (DW_TAG_variable)
    <a21>   DW_AT_name        : (indirect string, offset: 0x91357): lower
    <a25>   DW_AT_decl_file   : 1
    <a25>   DW_AT_decl_line   : 93
    <a26>   DW_AT_decl_column : 14
    <a27>   DW_AT_type        : <0x9a9>
    <a2b>   DW_AT_location    : 2 byte block: 91 66 	(DW_OP_fbreg: -26)
 <2><a2e>: Abbrev Number: 4 (DW_TAG_variable)
    <a2f>   DW_AT_name        : (indirect string, offset: 0x91405): upper
    <a33>   DW_AT_decl_file   : 1
    <a33>   DW_AT_decl_line   : 94
    <a34>   DW_AT_decl_column : 14
    <a35>   DW_AT_type        : <0x9a9>
    <a39>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><a3c>: Abbrev Number: 1 (DW_TAG_variable)
    <a3d>   DW_AT_name        : sum
    <a41>   DW_AT_decl_file   : 1
    <a41>   DW_AT_decl_line   : 97
    <a42>   DW_AT_decl_column : 14
    <a43>   DW_AT_type        : <0x9b5>
    <a47>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><a4a>: Abbrev Number: 4 (DW_TAG_variable)
    <a4b>   DW_AT_name        : (indirect string, offset: 0x956ba): count
    <a4f>   DW_AT_decl_file   : 1
    <a4f>   DW_AT_decl_line   : 98
    <a50>   DW_AT_decl_column : 13
    <a51>   DW_AT_type        : <0x99d>
    <a55>   DW_AT_location    : 2 byte block: 91 6b 	(DW_OP_fbreg: -21)
 <2><a58>: Abbrev Number: 12 (DW_TAG_lexical_block)
    <a59>   DW_AT_low_pc      : 0x8000206
    <a5d>   DW_AT_high_pc     : 0x4c
    <a61>   DW_AT_sibling     : <0xa72>
 <3><a65>: Abbrev Number: 1 (DW_TAG_variable)
    <a66>   DW_AT_name        : i
    <a68>   DW_AT_decl_file   : 1
    <a68>   DW_AT_decl_line   : 83
    <a69>   DW_AT_decl_column : 18
    <a6a>   DW_AT_type        : <0x99d>
    <a6e>   DW_AT_location    : 2 byte block: 91 73 	(DW_OP_fbreg: -13)
 <3><a71>: Abbrev Number: 0
 <2><a72>: Abbrev Number: 7 (DW_TAG_lexical_block)
    <a73>   DW_AT_low_pc      : 0x80002a0
    <a77>   DW_AT_high_pc     : 0x4c
 <3><a7b>: Abbrev Number: 1 (DW_TAG_variable)
    <a7c>   DW_AT_name        : i
    <a7e>   DW_AT_decl_file   : 1
    <a7e>   DW_AT_decl_line   : 99
    <a7f>   DW_AT_decl_column : 18
    <a80>   DW_AT_type        : <0x99d>
    <a84>   DW_AT_location    : 2 byte block: 91 6a 	(DW_OP_fbreg: -22)
 <3><a87>: Abbrev Number: 0
 <2><a88>: Abbrev Number: 0
 <1><a89>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <a8a>   DW_AT_byte_size   : 4
    <a8a>   DW_AT_type        : <0x9a9>
 <1><a8e>: Abbrev Number: 8 (DW_TAG_subprogram)
    <a8f>   DW_AT_external    : 1
    <a8f>   DW_AT_name        : (indirect string, offset: 0x9137e): Average_Caculate
    <a93>   DW_AT_decl_file   : 1
    <a93>   DW_AT_decl_line   : 56
    <a94>   DW_AT_decl_column : 10
    <a95>   DW_AT_prototyped  : 1
    <a95>   DW_AT_type        : <0x9a9>
    <a99>   DW_AT_low_pc      : 0
    <a9d>   DW_AT_high_pc     : 0x7e
    <aa1>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <aa3>   DW_AT_call_all_calls: 1
    <aa3>   DW_AT_sibling     : <0xb20>
 <2><aa7>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <aa8>   DW_AT_name        : (indirect string, offset: 0x9138f): adc_array
    <aac>   DW_AT_decl_file   : 1
    <aac>   DW_AT_decl_line   : 56
    <aad>   DW_AT_decl_column : 38
    <aae>   DW_AT_type        : <0xa89>
    <ab2>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><ab5>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <ab6>   DW_AT_name        : (indirect string, offset: 0x93e45): size
    <aba>   DW_AT_decl_file   : 1
    <aba>   DW_AT_decl_line   : 56
    <abb>   DW_AT_decl_column : 57
    <abc>   DW_AT_type        : <0x99d>
    <ac0>   DW_AT_location    : 2 byte block: 91 6b 	(DW_OP_fbreg: -21)
 <2><ac3>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <ac4>   DW_AT_name        : (indirect string, offset: 0x9134d): skip
    <ac8>   DW_AT_decl_file   : 1
    <ac8>   DW_AT_decl_line   : 56
    <ac9>   DW_AT_decl_column : 71
    <aca>   DW_AT_type        : <0x99d>
    <ace>   DW_AT_location    : 2 byte block: 91 6a 	(DW_OP_fbreg: -22)
 <2><ad1>: Abbrev Number: 4 (DW_TAG_variable)
    <ad2>   DW_AT_name        : (indirect string, offset: 0x9168e): start
    <ad6>   DW_AT_decl_file   : 1
    <ad6>   DW_AT_decl_line   : 62
    <ad7>   DW_AT_decl_column : 13
    <ad8>   DW_AT_type        : <0x99d>
    <adc>   DW_AT_location    : 2 byte block: 91 72 	(DW_OP_fbreg: -14)
 <2><adf>: Abbrev Number: 1 (DW_TAG_variable)
    <ae0>   DW_AT_name        : end
    <ae4>   DW_AT_decl_file   : 1
    <ae4>   DW_AT_decl_line   : 63
    <ae5>   DW_AT_decl_column : 13
    <ae6>   DW_AT_type        : <0x99d>
    <aea>   DW_AT_location    : 2 byte block: 91 71 	(DW_OP_fbreg: -15)
 <2><aed>: Abbrev Number: 4 (DW_TAG_variable)
    <aee>   DW_AT_name        : (indirect string, offset: 0x956ba): count
    <af2>   DW_AT_decl_file   : 1
    <af2>   DW_AT_decl_line   : 64
    <af3>   DW_AT_decl_column : 13
    <af4>   DW_AT_type        : <0x99d>
    <af8>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><afb>: Abbrev Number: 4 (DW_TAG_variable)
    <afc>   DW_AT_name        : (indirect string, offset: 0x91348): tong
    <b00>   DW_AT_decl_file   : 1
    <b00>   DW_AT_decl_line   : 65
    <b01>   DW_AT_decl_column : 14
    <b02>   DW_AT_type        : <0x9b5>
    <b06>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><b09>: Abbrev Number: 7 (DW_TAG_lexical_block)
    <b0a>   DW_AT_low_pc      : 0
    <b0e>   DW_AT_high_pc     : 0x26
 <3><b12>: Abbrev Number: 1 (DW_TAG_variable)
    <b13>   DW_AT_name        : i
    <b15>   DW_AT_decl_file   : 1
    <b15>   DW_AT_decl_line   : 67
    <b16>   DW_AT_decl_column : 18
    <b17>   DW_AT_type        : <0x99d>
    <b1b>   DW_AT_location    : 2 byte block: 91 73 	(DW_OP_fbreg: -13)
 <3><b1e>: Abbrev Number: 0
 <2><b1f>: Abbrev Number: 0
 <1><b20>: Abbrev Number: 13 (DW_TAG_subprogram)
    <b21>   DW_AT_external    : 1
    <b21>   DW_AT_name        : (indirect string, offset: 0x91326): quickSortArray_uint16
    <b25>   DW_AT_decl_file   : 1
    <b26>   DW_AT_decl_line   : 52
    <b27>   DW_AT_decl_column : 6
    <b28>   DW_AT_prototyped  : 1
    <b28>   DW_AT_low_pc      : 0
    <b2c>   DW_AT_high_pc     : 0x20
    <b30>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b32>   DW_AT_call_all_tail_calls: 1
    <b32>   DW_AT_sibling     : <0xb51>
 <2><b36>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <b37>   DW_AT_name        : arr
    <b3b>   DW_AT_decl_file   : 1
    <b3b>   DW_AT_decl_line   : 52
    <b3c>   DW_AT_decl_column : 37
    <b3d>   DW_AT_type        : <0xa89>
    <b41>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><b44>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <b45>   DW_AT_name        : n
    <b47>   DW_AT_decl_file   : 1
    <b47>   DW_AT_decl_line   : 52
    <b48>   DW_AT_decl_column : 48
    <b49>   DW_AT_type        : <0x98f>
    <b4d>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><b50>: Abbrev Number: 0
 <1><b51>: Abbrev Number: 14 (DW_TAG_subprogram)
    <b52>   DW_AT_name        : (indirect string, offset: 0x91399): quickSort_uint16
    <b56>   DW_AT_decl_file   : 1
    <b57>   DW_AT_decl_line   : 40
    <b58>   DW_AT_decl_column : 13
    <b59>   DW_AT_prototyped  : 1
    <b59>   DW_AT_low_pc      : 0
    <b5d>   DW_AT_high_pc     : 0x44
    <b61>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b63>   DW_AT_call_all_tail_calls: 1
    <b63>   DW_AT_sibling     : <0xba9>
 <2><b67>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <b68>   DW_AT_name        : arr
    <b6c>   DW_AT_decl_file   : 1
    <b6c>   DW_AT_decl_line   : 40
    <b6d>   DW_AT_decl_column : 39
    <b6e>   DW_AT_type        : <0xa89>
    <b72>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><b75>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <b76>   DW_AT_name        : low
    <b7a>   DW_AT_decl_file   : 1
    <b7a>   DW_AT_decl_line   : 40
    <b7b>   DW_AT_decl_column : 50
    <b7c>   DW_AT_type        : <0x98f>
    <b80>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><b83>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <b84>   DW_AT_name        : (indirect string, offset: 0x91352): high
    <b88>   DW_AT_decl_file   : 1
    <b88>   DW_AT_decl_line   : 40
    <b89>   DW_AT_decl_column : 59
    <b8a>   DW_AT_type        : <0x98f>
    <b8e>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><b91>: Abbrev Number: 7 (DW_TAG_lexical_block)
    <b92>   DW_AT_low_pc      : 0
    <b96>   DW_AT_high_pc     : 0x28
 <3><b9a>: Abbrev Number: 1 (DW_TAG_variable)
    <b9b>   DW_AT_name        : pi
    <b9e>   DW_AT_decl_file   : 1
    <b9e>   DW_AT_decl_line   : 44
    <b9f>   DW_AT_decl_column : 13
    <ba0>   DW_AT_type        : <0x98f>
    <ba4>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><ba7>: Abbrev Number: 0
 <2><ba8>: Abbrev Number: 0
 <1><ba9>: Abbrev Number: 15 (DW_TAG_subprogram)
    <baa>   DW_AT_name        : (indirect string, offset: 0x913d8): partition_uint16
    <bae>   DW_AT_decl_file   : 1
    <baf>   DW_AT_decl_line   : 22
    <bb0>   DW_AT_decl_column : 12
    <bb1>   DW_AT_prototyped  : 1
    <bb1>   DW_AT_type        : <0x98f>
    <bb5>   DW_AT_low_pc      : 0
    <bb9>   DW_AT_high_pc     : 0x82
    <bbd>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bbf>   DW_AT_call_all_tail_calls: 1
    <bbf>   DW_AT_sibling     : <0xc1e>
 <2><bc3>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <bc4>   DW_AT_name        : arr
    <bc8>   DW_AT_decl_file   : 1
    <bc8>   DW_AT_decl_line   : 22
    <bc9>   DW_AT_decl_column : 38
    <bca>   DW_AT_type        : <0xa89>
    <bce>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><bd1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <bd2>   DW_AT_name        : low
    <bd6>   DW_AT_decl_file   : 1
    <bd6>   DW_AT_decl_line   : 22
    <bd7>   DW_AT_decl_column : 49
    <bd8>   DW_AT_type        : <0x98f>
    <bdc>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><bdf>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <be0>   DW_AT_name        : (indirect string, offset: 0x91352): high
    <be4>   DW_AT_decl_file   : 1
    <be4>   DW_AT_decl_line   : 22
    <be5>   DW_AT_decl_column : 58
    <be6>   DW_AT_type        : <0x98f>
    <bea>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><bed>: Abbrev Number: 4 (DW_TAG_variable)
    <bee>   DW_AT_name        : (indirect string, offset: 0x913f1): pivot
    <bf2>   DW_AT_decl_file   : 1
    <bf2>   DW_AT_decl_line   : 24
    <bf3>   DW_AT_decl_column : 14
    <bf4>   DW_AT_type        : <0x9a9>
    <bf8>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><bfb>: Abbrev Number: 1 (DW_TAG_variable)
    <bfc>   DW_AT_name        : i
    <bfe>   DW_AT_decl_file   : 1
    <bfe>   DW_AT_decl_line   : 25
    <bff>   DW_AT_decl_column : 9
    <c00>   DW_AT_type        : <0x98f>
    <c04>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><c07>: Abbrev Number: 7 (DW_TAG_lexical_block)
    <c08>   DW_AT_low_pc      : 0
    <c0c>   DW_AT_high_pc     : 0x40
 <3><c10>: Abbrev Number: 1 (DW_TAG_variable)
    <c11>   DW_AT_name        : j
    <c13>   DW_AT_decl_file   : 1
    <c13>   DW_AT_decl_line   : 27
    <c14>   DW_AT_decl_column : 14
    <c15>   DW_AT_type        : <0x98f>
    <c19>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><c1c>: Abbrev Number: 0
 <2><c1d>: Abbrev Number: 0
 <1><c1e>: Abbrev Number: 16 (DW_TAG_subprogram)
    <c1f>   DW_AT_name        : (indirect string, offset: 0x913aa): swap_uint16
    <c23>   DW_AT_decl_file   : 1
    <c24>   DW_AT_decl_line   : 14
    <c25>   DW_AT_decl_column : 13
    <c26>   DW_AT_prototyped  : 1
    <c26>   DW_AT_low_pc      : 0
    <c2a>   DW_AT_high_pc     : 0x28
    <c2e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c30>   DW_AT_call_all_calls: 1
    <c30>   DW_AT_sibling     : <0xc5b>
 <2><c34>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <c35>   DW_AT_name        : a
    <c37>   DW_AT_decl_file   : 1
    <c37>   DW_AT_decl_line   : 14
    <c38>   DW_AT_decl_column : 35
    <c39>   DW_AT_type        : <0xa89>
    <c3d>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><c40>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <c41>   DW_AT_name        : b
    <c43>   DW_AT_decl_file   : 1
    <c43>   DW_AT_decl_line   : 14
    <c44>   DW_AT_decl_column : 48
    <c45>   DW_AT_type        : <0xa89>
    <c49>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><c4c>: Abbrev Number: 4 (DW_TAG_variable)
    <c4d>   DW_AT_name        : (indirect string, offset: 0x9133c): temp
    <c51>   DW_AT_decl_file   : 1
    <c51>   DW_AT_decl_line   : 16
    <c52>   DW_AT_decl_column : 14
    <c53>   DW_AT_type        : <0x9a9>
    <c57>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><c5a>: Abbrev Number: 0
 <1><c5b>: Abbrev Number: 8 (DW_TAG_subprogram)
    <c5c>   DW_AT_external    : 1
    <c5c>   DW_AT_name        : (indirect string, offset: 0x913e9): compare
    <c60>   DW_AT_decl_file   : 1
    <c60>   DW_AT_decl_line   : 9
    <c61>   DW_AT_decl_column : 5
    <c62>   DW_AT_prototyped  : 1
    <c62>   DW_AT_type        : <0x98f>
    <c66>   DW_AT_low_pc      : 0
    <c6a>   DW_AT_high_pc     : 0x1e
    <c6e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c70>   DW_AT_call_all_calls: 1
    <c70>   DW_AT_sibling     : <0xc8d>
 <2><c74>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <c75>   DW_AT_name        : a
    <c77>   DW_AT_decl_file   : 1
    <c77>   DW_AT_decl_line   : 9
    <c78>   DW_AT_decl_column : 25
    <c79>   DW_AT_type        : <0xc8d>
    <c7d>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><c80>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <c81>   DW_AT_name        : b
    <c83>   DW_AT_decl_file   : 1
    <c83>   DW_AT_decl_line   : 9
    <c84>   DW_AT_decl_column : 40
    <c85>   DW_AT_type        : <0xc8d>
    <c89>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><c8c>: Abbrev Number: 0
 <1><c8d>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <c8e>   DW_AT_byte_size   : 4
    <c8e>   DW_AT_type        : <0xc92>
 <1><c92>: Abbrev Number: 17 (DW_TAG_const_type)
 <1><c93>: Abbrev Number: 0
  Compilation Unit @ offset 0xc94:
   Length:        0x2a9 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x310
   Pointer Size:  4
 <0><ca0>: Abbrev Number: 12 (DW_TAG_compile_unit)
    <ca1>   DW_AT_producer    : (indirect string, offset: 0x1cf91): GNU C11 12.3.1 20230626 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <ca5>   DW_AT_language    : 29	(C11)
    <ca6>   DW_AT_name        : (indirect string, offset: 0x91526): ../Core/Src/handler_button.c
    <caa>   DW_AT_comp_dir    : (indirect string, offset: 0x877e4): E:/Mcnex/IR_Fillter/IR_Fillter_RTOS/Debug
    <cae>   DW_AT_ranges      : 0x6a
    <cb2>   DW_AT_low_pc      : 0
    <cb6>   DW_AT_stmt_list   : 0xefa
    <cba>   DW_AT_macros      : 0x17442
 <1><cbe>: Abbrev Number: 1 (DW_TAG_base_type)
    <cbf>   DW_AT_byte_size   : 1
    <cc0>   DW_AT_encoding    : 6	(signed char)
    <cc1>   DW_AT_name        : (indirect string, offset: 0x48c28): signed char
 <1><cc5>: Abbrev Number: 2 (DW_TAG_typedef)
    <cc6>   DW_AT_name        : (indirect string, offset: 0x2a488): __uint8_t
    <cca>   DW_AT_decl_file   : 2
    <ccb>   DW_AT_decl_line   : 43
    <ccc>   DW_AT_decl_column : 24
    <ccd>   DW_AT_type        : <0xcd1>
 <1><cd1>: Abbrev Number: 1 (DW_TAG_base_type)
    <cd2>   DW_AT_byte_size   : 1
    <cd3>   DW_AT_encoding    : 8	(unsigned char)
    <cd4>   DW_AT_name        : (indirect string, offset: 0x1d5fa): unsigned char
 <1><cd8>: Abbrev Number: 1 (DW_TAG_base_type)
    <cd9>   DW_AT_byte_size   : 2
    <cda>   DW_AT_encoding    : 5	(signed)
    <cdb>   DW_AT_name        : (indirect string, offset: 0x6c8cd): short int
 <1><cdf>: Abbrev Number: 2 (DW_TAG_typedef)
    <ce0>   DW_AT_name        : (indirect string, offset: 0x76cfb): __uint16_t
    <ce4>   DW_AT_decl_file   : 2
    <ce5>   DW_AT_decl_line   : 57
    <ce6>   DW_AT_decl_column : 25
    <ce7>   DW_AT_type        : <0xceb>
 <1><ceb>: Abbrev Number: 1 (DW_TAG_base_type)
    <cec>   DW_AT_byte_size   : 2
    <ced>   DW_AT_encoding    : 7	(unsigned)
    <cee>   DW_AT_name        : (indirect string, offset: 0x2f8e4): short unsigned int
 <1><cf2>: Abbrev Number: 1 (DW_TAG_base_type)
    <cf3>   DW_AT_byte_size   : 4
    <cf4>   DW_AT_encoding    : 5	(signed)
    <cf5>   DW_AT_name        : (indirect string, offset: 0xc9a3): long int
 <1><cf9>: Abbrev Number: 2 (DW_TAG_typedef)
    <cfa>   DW_AT_name        : (indirect string, offset: 0x5c7c7): __uint32_t
    <cfe>   DW_AT_decl_file   : 2
    <cff>   DW_AT_decl_line   : 79
    <d00>   DW_AT_decl_column : 25
    <d01>   DW_AT_type        : <0xd05>
 <1><d05>: Abbrev Number: 1 (DW_TAG_base_type)
    <d06>   DW_AT_byte_size   : 4
    <d07>   DW_AT_encoding    : 7	(unsigned)
    <d08>   DW_AT_name        : (indirect string, offset: 0x21fab): long unsigned int
 <1><d0c>: Abbrev Number: 1 (DW_TAG_base_type)
    <d0d>   DW_AT_byte_size   : 8
    <d0e>   DW_AT_encoding    : 5	(signed)
    <d0f>   DW_AT_name        : (indirect string, offset: 0x42985): long long int
 <1><d13>: Abbrev Number: 1 (DW_TAG_base_type)
    <d14>   DW_AT_byte_size   : 8
    <d15>   DW_AT_encoding    : 7	(unsigned)
    <d16>   DW_AT_name        : (indirect string, offset: 0x1e0bb): long long unsigned int
 <1><d1a>: Abbrev Number: 13 (DW_TAG_base_type)
    <d1b>   DW_AT_byte_size   : 4
    <d1c>   DW_AT_encoding    : 5	(signed)
    <d1d>   DW_AT_name        : int
 <1><d21>: Abbrev Number: 1 (DW_TAG_base_type)
    <d22>   DW_AT_byte_size   : 4
    <d23>   DW_AT_encoding    : 7	(unsigned)
    <d24>   DW_AT_name        : (indirect string, offset: 0xc2e5): unsigned int
 <1><d28>: Abbrev Number: 2 (DW_TAG_typedef)
    <d29>   DW_AT_name        : (indirect string, offset: 0x2a48a): uint8_t
    <d2d>   DW_AT_decl_file   : 3
    <d2e>   DW_AT_decl_line   : 24
    <d2f>   DW_AT_decl_column : 19
    <d30>   DW_AT_type        : <0xcc5>
 <1><d34>: Abbrev Number: 2 (DW_TAG_typedef)
    <d35>   DW_AT_name        : (indirect string, offset: 0x6a5c0): uint16_t
    <d39>   DW_AT_decl_file   : 3
    <d3a>   DW_AT_decl_line   : 36
    <d3b>   DW_AT_decl_column : 20
    <d3c>   DW_AT_type        : <0xcdf>
 <1><d40>: Abbrev Number: 2 (DW_TAG_typedef)
    <d41>   DW_AT_name        : (indirect string, offset: 0x69eda): uint32_t
    <d45>   DW_AT_decl_file   : 3
    <d46>   DW_AT_decl_line   : 48
    <d47>   DW_AT_decl_column : 20
    <d48>   DW_AT_type        : <0xcf9>
 <1><d4c>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <d4d>   DW_AT_type        : <0xd40>
 <1><d51>: Abbrev Number: 15 (DW_TAG_structure_type)
    <d52>   DW_AT_byte_size   : 28
    <d53>   DW_AT_decl_file   : 4
    <d54>   DW_AT_decl_line   : 357
    <d56>   DW_AT_decl_column : 9
    <d57>   DW_AT_sibling     : <0xdb0>
 <2><d5b>: Abbrev Number: 5 (DW_TAG_member)
    <d5c>   DW_AT_name        : CRL
    <d60>   DW_AT_decl_file   : 4
    <d60>   DW_AT_decl_line   : 359
    <d62>   DW_AT_decl_column : 17
    <d62>   DW_AT_type        : <0xd4c>
    <d66>   DW_AT_data_member_location: 0
 <2><d67>: Abbrev Number: 5 (DW_TAG_member)
    <d68>   DW_AT_name        : CRH
    <d6c>   DW_AT_decl_file   : 4
    <d6c>   DW_AT_decl_line   : 360
    <d6e>   DW_AT_decl_column : 17
    <d6e>   DW_AT_type        : <0xd4c>
    <d72>   DW_AT_data_member_location: 4
 <2><d73>: Abbrev Number: 5 (DW_TAG_member)
    <d74>   DW_AT_name        : IDR
    <d78>   DW_AT_decl_file   : 4
    <d78>   DW_AT_decl_line   : 361
    <d7a>   DW_AT_decl_column : 17
    <d7a>   DW_AT_type        : <0xd4c>
    <d7e>   DW_AT_data_member_location: 8
 <2><d7f>: Abbrev Number: 5 (DW_TAG_member)
    <d80>   DW_AT_name        : ODR
    <d84>   DW_AT_decl_file   : 4
    <d84>   DW_AT_decl_line   : 362
    <d86>   DW_AT_decl_column : 17
    <d86>   DW_AT_type        : <0xd4c>
    <d8a>   DW_AT_data_member_location: 12
 <2><d8b>: Abbrev Number: 8 (DW_TAG_member)
    <d8c>   DW_AT_name        : (indirect string, offset: 0x914ac): BSRR
    <d90>   DW_AT_decl_file   : 4
    <d90>   DW_AT_decl_line   : 363
    <d92>   DW_AT_decl_column : 17
    <d92>   DW_AT_type        : <0xd4c>
    <d96>   DW_AT_data_member_location: 16
 <2><d97>: Abbrev Number: 5 (DW_TAG_member)
    <d98>   DW_AT_name        : BRR
    <d9c>   DW_AT_decl_file   : 4
    <d9c>   DW_AT_decl_line   : 364
    <d9e>   DW_AT_decl_column : 17
    <d9e>   DW_AT_type        : <0xd4c>
    <da2>   DW_AT_data_member_location: 20
 <2><da3>: Abbrev Number: 8 (DW_TAG_member)
    <da4>   DW_AT_name        : (indirect string, offset: 0x915a3): LCKR
    <da8>   DW_AT_decl_file   : 4
    <da8>   DW_AT_decl_line   : 365
    <daa>   DW_AT_decl_column : 17
    <daa>   DW_AT_type        : <0xd4c>
    <dae>   DW_AT_data_member_location: 24
 <2><daf>: Abbrev Number: 0
 <1><db0>: Abbrev Number: 16 (DW_TAG_typedef)
    <db1>   DW_AT_name        : (indirect string, offset: 0x915cc): GPIO_TypeDef
    <db5>   DW_AT_decl_file   : 4
    <db6>   DW_AT_decl_line   : 366
    <db8>   DW_AT_decl_column : 3
    <db9>   DW_AT_type        : <0xd51>
 <1><dbd>: Abbrev Number: 1 (DW_TAG_base_type)
    <dbe>   DW_AT_byte_size   : 8
    <dbf>   DW_AT_encoding    : 4	(float)
    <dc0>   DW_AT_name        : (indirect string, offset: 0x9541e): long double
 <1><dc4>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <dc5>   DW_AT_encoding    : 7	(unsigned)
    <dc5>   DW_AT_byte_size   : 1
    <dc5>   DW_AT_type        : <0xcd1>
    <dc9>   DW_AT_decl_file   : 5
    <dca>   DW_AT_decl_line   : 65
    <dcb>   DW_AT_decl_column : 1
    <dcc>   DW_AT_sibling     : <0xddd>
 <2><dd0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <dd1>   DW_AT_name        : (indirect string, offset: 0x9149d): GPIO_PIN_RESET
    <dd5>   DW_AT_const_value : 0
 <2><dd6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <dd7>   DW_AT_name        : (indirect string, offset: 0x91490): GPIO_PIN_SET
    <ddb>   DW_AT_const_value : 1
 <2><ddc>: Abbrev Number: 0
 <1><ddd>: Abbrev Number: 2 (DW_TAG_typedef)
    <dde>   DW_AT_name        : (indirect string, offset: 0x915ed): GPIO_PinState
    <de2>   DW_AT_decl_file   : 5
    <de3>   DW_AT_decl_line   : 68
    <de4>   DW_AT_decl_column : 3
    <de5>   DW_AT_type        : <0xdc4>
 <1><de9>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <dea>   DW_AT_encoding    : 7	(unsigned)
    <dea>   DW_AT_byte_size   : 1
    <dea>   DW_AT_type        : <0xcd1>
    <dee>   DW_AT_decl_file   : 6
    <def>   DW_AT_decl_line   : 22
    <df0>   DW_AT_decl_column : 14
    <df1>   DW_AT_sibling     : <0xe0e>
 <2><df5>: Abbrev Number: 3 (DW_TAG_enumerator)
    <df6>   DW_AT_name        : (indirect string, offset: 0x914de): NO_CLICK
    <dfa>   DW_AT_const_value : 0
 <2><dfb>: Abbrev Number: 3 (DW_TAG_enumerator)
    <dfc>   DW_AT_name        : (indirect string, offset: 0x91442): SINGLE_CLICK
    <e00>   DW_AT_const_value : 1
 <2><e01>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e02>   DW_AT_name        : (indirect string, offset: 0x915a8): DOUBLE_CLICK
    <e06>   DW_AT_const_value : 2
 <2><e07>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e08>   DW_AT_name        : (indirect string, offset: 0x91510): LONGCLICK_3S
    <e0c>   DW_AT_const_value : 3
 <2><e0d>: Abbrev Number: 0
 <1><e0e>: Abbrev Number: 2 (DW_TAG_typedef)
    <e0f>   DW_AT_name        : (indirect string, offset: 0x914e7): ButtonState_t
    <e13>   DW_AT_decl_file   : 6
    <e14>   DW_AT_decl_line   : 27
    <e15>   DW_AT_decl_column : 3
    <e16>   DW_AT_type        : <0xde9>
 <1><e1a>: Abbrev Number: 17 (DW_TAG_structure_type)
    <e1b>   DW_AT_byte_size   : 12
    <e1c>   DW_AT_decl_file   : 6
    <e1d>   DW_AT_decl_line   : 29
    <e1e>   DW_AT_decl_column : 9
    <e1f>   DW_AT_sibling     : <0xe6c>
 <2><e23>: Abbrev Number: 4 (DW_TAG_member)
    <e24>   DW_AT_name        : (indirect string, offset: 0x91597): BUTTON_Port
    <e28>   DW_AT_decl_file   : 6
    <e28>   DW_AT_decl_line   : 30
    <e29>   DW_AT_decl_column : 16
    <e2a>   DW_AT_type        : <0xe6c>
    <e2e>   DW_AT_data_member_location: 0
 <2><e2f>: Abbrev Number: 4 (DW_TAG_member)
    <e30>   DW_AT_name        : (indirect string, offset: 0x9158c): BUTTON_Pin
    <e34>   DW_AT_decl_file   : 6
    <e34>   DW_AT_decl_line   : 31
    <e35>   DW_AT_decl_column : 11
    <e36>   DW_AT_type        : <0xd34>
    <e3a>   DW_AT_data_member_location: 4
 <2><e3b>: Abbrev Number: 4 (DW_TAG_member)
    <e3c>   DW_AT_name        : (indirect string, offset: 0x96f3a): State
    <e40>   DW_AT_decl_file   : 6
    <e40>   DW_AT_decl_line   : 32
    <e41>   DW_AT_decl_column : 17
    <e42>   DW_AT_type        : <0xe0e>
    <e46>   DW_AT_data_member_location: 6
 <2><e47>: Abbrev Number: 4 (DW_TAG_member)
    <e48>   DW_AT_name        : (indirect string, offset: 0x91508): isPress
    <e4c>   DW_AT_decl_file   : 6
    <e4c>   DW_AT_decl_line   : 33
    <e4d>   DW_AT_decl_column : 10
    <e4e>   DW_AT_type        : <0xd28>
    <e52>   DW_AT_data_member_location: 7
 <2><e53>: Abbrev Number: 4 (DW_TAG_member)
    <e54>   DW_AT_name        : (indirect string, offset: 0x914fe): timePress
    <e58>   DW_AT_decl_file   : 6
    <e58>   DW_AT_decl_line   : 34
    <e59>   DW_AT_decl_column : 11
    <e5a>   DW_AT_type        : <0xd34>
    <e5e>   DW_AT_data_member_location: 8
 <2><e5f>: Abbrev Number: 4 (DW_TAG_member)
    <e60>   DW_AT_name        : (indirect string, offset: 0x91458): timeDouble
    <e64>   DW_AT_decl_file   : 6
    <e64>   DW_AT_decl_line   : 35
    <e65>   DW_AT_decl_column : 11
    <e66>   DW_AT_type        : <0xd34>
    <e6a>   DW_AT_data_member_location: 10
 <2><e6b>: Abbrev Number: 0
 <1><e6c>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <e6d>   DW_AT_byte_size   : 4
    <e6d>   DW_AT_type        : <0xdb0>
 <1><e71>: Abbrev Number: 2 (DW_TAG_typedef)
    <e72>   DW_AT_name        : (indirect string, offset: 0x915d9): Button_name_t
    <e76>   DW_AT_decl_file   : 6
    <e77>   DW_AT_decl_line   : 37
    <e78>   DW_AT_decl_column : 2
    <e79>   DW_AT_type        : <0xe1a>
 <1><e7d>: Abbrev Number: 18 (DW_TAG_subprogram)
    <e7e>   DW_AT_external    : 1
    <e7e>   DW_AT_name        : (indirect string, offset: 0x914f5): Delay_ms
    <e82>   DW_AT_decl_file   : 7
    <e83>   DW_AT_decl_line   : 11
    <e84>   DW_AT_decl_column : 6
    <e85>   DW_AT_prototyped  : 1
    <e85>   DW_AT_declaration : 1
    <e85>   DW_AT_sibling     : <0xe8f>
 <2><e89>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <e8a>   DW_AT_type        : <0xd40>
 <2><e8e>: Abbrev Number: 0
 <1><e8f>: Abbrev Number: 19 (DW_TAG_subprogram)
    <e90>   DW_AT_external    : 1
    <e90>   DW_AT_name        : (indirect string, offset: 0x91543): HAL_GPIO_ReadPin
    <e94>   DW_AT_decl_file   : 5
    <e95>   DW_AT_decl_line   : 233
    <e96>   DW_AT_decl_column : 15
    <e97>   DW_AT_prototyped  : 1
    <e97>   DW_AT_type        : <0xddd>
    <e9b>   DW_AT_declaration : 1
    <e9b>   DW_AT_sibling     : <0xeaa>
 <2><e9f>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <ea0>   DW_AT_type        : <0xe6c>
 <2><ea4>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <ea5>   DW_AT_type        : <0xd34>
 <2><ea9>: Abbrev Number: 0
 <1><eaa>: Abbrev Number: 11 (DW_TAG_subprogram)
    <eab>   DW_AT_external    : 1
    <eab>   DW_AT_name        : (indirect string, offset: 0x91564): BUTTON_Read
    <eaf>   DW_AT_decl_file   : 1
    <eaf>   DW_AT_decl_line   : 25
    <eb0>   DW_AT_decl_column : 15
    <eb1>   DW_AT_prototyped  : 1
    <eb1>   DW_AT_type        : <0xe0e>
    <eb5>   DW_AT_low_pc      : 0x8000358
    <eb9>   DW_AT_high_pc     : 0xf4
    <ebd>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ebf>   DW_AT_call_all_tail_calls: 1
    <ebf>   DW_AT_sibling     : <0xed2>
 <2><ec3>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <ec4>   DW_AT_name        : (indirect string, offset: 0x971fb): Button
    <ec8>   DW_AT_decl_file   : 1
    <ec8>   DW_AT_decl_line   : 25
    <ec9>   DW_AT_decl_column : 42
    <eca>   DW_AT_type        : <0xed2>
    <ece>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><ed1>: Abbrev Number: 0
 <1><ed2>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <ed3>   DW_AT_byte_size   : 4
    <ed3>   DW_AT_type        : <0xe71>
 <1><ed7>: Abbrev Number: 11 (DW_TAG_subprogram)
    <ed8>   DW_AT_external    : 1
    <ed8>   DW_AT_name        : (indirect string, offset: 0x91570): Button_Read_Pin
    <edc>   DW_AT_decl_file   : 1
    <edc>   DW_AT_decl_line   : 20
    <edd>   DW_AT_decl_column : 9
    <ede>   DW_AT_prototyped  : 1
    <ede>   DW_AT_type        : <0xd28>
    <ee2>   DW_AT_low_pc      : 0x8000336
    <ee6>   DW_AT_high_pc     : 0x22
    <eea>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <eec>   DW_AT_call_all_tail_calls: 1
    <eec>   DW_AT_sibling     : <0xeff>
 <2><ef0>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <ef1>   DW_AT_name        : (indirect string, offset: 0x971fb): Button
    <ef5>   DW_AT_decl_file   : 1
    <ef5>   DW_AT_decl_line   : 20
    <ef6>   DW_AT_decl_column : 41
    <ef7>   DW_AT_type        : <0xed2>
    <efb>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><efe>: Abbrev Number: 0
 <1><eff>: Abbrev Number: 20 (DW_TAG_subprogram)
    <f00>   DW_AT_external    : 1
    <f00>   DW_AT_name        : (indirect string, offset: 0x91580): Button_Init
    <f04>   DW_AT_decl_file   : 1
    <f05>   DW_AT_decl_line   : 14
    <f06>   DW_AT_decl_column : 9
    <f07>   DW_AT_prototyped  : 1
    <f07>   DW_AT_type        : <0xd28>
    <f0b>   DW_AT_low_pc      : 0x8000310
    <f0f>   DW_AT_high_pc     : 0x26
    <f13>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f15>   DW_AT_call_all_calls: 1
 <2><f15>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <f16>   DW_AT_name        : (indirect string, offset: 0x971fb): Button
    <f1a>   DW_AT_decl_file   : 1
    <f1a>   DW_AT_decl_line   : 14
    <f1b>   DW_AT_decl_column : 37
    <f1c>   DW_AT_type        : <0xed2>
    <f20>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><f23>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <f24>   DW_AT_name        : (indirect string, offset: 0x915e7): GPIOx
    <f28>   DW_AT_decl_file   : 1
    <f28>   DW_AT_decl_line   : 14
    <f29>   DW_AT_decl_column : 60
    <f2a>   DW_AT_type        : <0xe6c>
    <f2e>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><f31>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <f32>   DW_AT_name        : (indirect string, offset: 0x9151d): GPIO_PIN
    <f36>   DW_AT_decl_file   : 1
    <f36>   DW_AT_decl_line   : 14
    <f37>   DW_AT_decl_column : 76
    <f38>   DW_AT_type        : <0xd34>
    <f3c>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><f3f>: Abbrev Number: 0
 <1><f40>: Abbrev Number: 0
  Compilation Unit @ offset 0xf41:
   Length:        0x137 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x45d
   Pointer Size:  4
 <0><f4d>: Abbrev Number: 6 (DW_TAG_compile_unit)
    <f4e>   DW_AT_producer    : (indirect string, offset: 0x1cf91): GNU C11 12.3.1 20230626 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <f52>   DW_AT_language    : 29	(C11)
    <f53>   DW_AT_name        : (indirect string, offset: 0x9163e): ../Core/Src/handler_delay.c
    <f57>   DW_AT_comp_dir    : (indirect string, offset: 0x915fb): C:/Users/Admin/STM32CubeIDE/workspace_1.16.0/IR_Fillter_RTOS/Debug
    <f5b>   DW_AT_ranges      : 0x96
    <f5f>   DW_AT_low_pc      : 0
    <f63>   DW_AT_stmt_list   : 0x176a
    <f67>   DW_AT_macros      : 0x17673
 <1><f6b>: Abbrev Number: 1 (DW_TAG_base_type)
    <f6c>   DW_AT_byte_size   : 1
    <f6d>   DW_AT_encoding    : 6	(signed char)
    <f6e>   DW_AT_name        : (indirect string, offset: 0x48c28): signed char
 <1><f72>: Abbrev Number: 2 (DW_TAG_typedef)
    <f73>   DW_AT_name        : (indirect string, offset: 0x2a488): __uint8_t
    <f77>   DW_AT_decl_file   : 2
    <f78>   DW_AT_decl_line   : 43
    <f79>   DW_AT_decl_column : 24
    <f7a>   DW_AT_type        : <0xf7e>
 <1><f7e>: Abbrev Number: 1 (DW_TAG_base_type)
    <f7f>   DW_AT_byte_size   : 1
    <f80>   DW_AT_encoding    : 8	(unsigned char)
    <f81>   DW_AT_name        : (indirect string, offset: 0x1d5fa): unsigned char
 <1><f85>: Abbrev Number: 1 (DW_TAG_base_type)
    <f86>   DW_AT_byte_size   : 2
    <f87>   DW_AT_encoding    : 5	(signed)
    <f88>   DW_AT_name        : (indirect string, offset: 0x6c8cd): short int
 <1><f8c>: Abbrev Number: 1 (DW_TAG_base_type)
    <f8d>   DW_AT_byte_size   : 2
    <f8e>   DW_AT_encoding    : 7	(unsigned)
    <f8f>   DW_AT_name        : (indirect string, offset: 0x2f8e4): short unsigned int
 <1><f93>: Abbrev Number: 1 (DW_TAG_base_type)
    <f94>   DW_AT_byte_size   : 4
    <f95>   DW_AT_encoding    : 5	(signed)
    <f96>   DW_AT_name        : (indirect string, offset: 0xc9a3): long int
 <1><f9a>: Abbrev Number: 2 (DW_TAG_typedef)
    <f9b>   DW_AT_name        : (indirect string, offset: 0x5c7c7): __uint32_t
    <f9f>   DW_AT_decl_file   : 2
    <fa0>   DW_AT_decl_line   : 79
    <fa1>   DW_AT_decl_column : 25
    <fa2>   DW_AT_type        : <0xfa6>
 <1><fa6>: Abbrev Number: 1 (DW_TAG_base_type)
    <fa7>   DW_AT_byte_size   : 4
    <fa8>   DW_AT_encoding    : 7	(unsigned)
    <fa9>   DW_AT_name        : (indirect string, offset: 0x21fab): long unsigned int
 <1><fad>: Abbrev Number: 1 (DW_TAG_base_type)
    <fae>   DW_AT_byte_size   : 8
    <faf>   DW_AT_encoding    : 5	(signed)
    <fb0>   DW_AT_name        : (indirect string, offset: 0x42985): long long int
 <1><fb4>: Abbrev Number: 1 (DW_TAG_base_type)
    <fb5>   DW_AT_byte_size   : 8
    <fb6>   DW_AT_encoding    : 7	(unsigned)
    <fb7>   DW_AT_name        : (indirect string, offset: 0x1e0bb): long long unsigned int
 <1><fbb>: Abbrev Number: 7 (DW_TAG_base_type)
    <fbc>   DW_AT_byte_size   : 4
    <fbd>   DW_AT_encoding    : 5	(signed)
    <fbe>   DW_AT_name        : int
 <1><fc2>: Abbrev Number: 1 (DW_TAG_base_type)
    <fc3>   DW_AT_byte_size   : 4
    <fc4>   DW_AT_encoding    : 7	(unsigned)
    <fc5>   DW_AT_name        : (indirect string, offset: 0xc2e5): unsigned int
 <1><fc9>: Abbrev Number: 2 (DW_TAG_typedef)
    <fca>   DW_AT_name        : (indirect string, offset: 0x2a48a): uint8_t
    <fce>   DW_AT_decl_file   : 3
    <fcf>   DW_AT_decl_line   : 24
    <fd0>   DW_AT_decl_column : 19
    <fd1>   DW_AT_type        : <0xf72>
 <1><fd5>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <fd6>   DW_AT_type        : <0xfc9>
 <1><fda>: Abbrev Number: 2 (DW_TAG_typedef)
    <fdb>   DW_AT_name        : (indirect string, offset: 0x69eda): uint32_t
    <fdf>   DW_AT_decl_file   : 3
    <fe0>   DW_AT_decl_line   : 48
    <fe1>   DW_AT_decl_column : 20
    <fe2>   DW_AT_type        : <0xf9a>
 <1><fe6>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <fe7>   DW_AT_type        : <0xfda>
 <1><feb>: Abbrev Number: 8 (DW_TAG_variable)
    <fec>   DW_AT_name        : (indirect string, offset: 0x9165a): timer1_counter
    <ff0>   DW_AT_decl_file   : 1
    <ff1>   DW_AT_decl_line   : 10
    <ff2>   DW_AT_decl_column : 26
    <ff3>   DW_AT_type        : <0xfe6>
    <ff7>   DW_AT_external    : 1
    <ff7>   DW_AT_declaration : 1
 <1><ff7>: Abbrev Number: 3 (DW_TAG_variable)
    <ff8>   DW_AT_name        : (indirect string, offset: 0x91688): delay_start
    <ffc>   DW_AT_decl_file   : 1
    <ffc>   DW_AT_decl_line   : 12
    <ffd>   DW_AT_decl_column : 19
    <ffe>   DW_AT_type        : <0xfe6>
    <1002>   DW_AT_external    : 1
    <1002>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><1008>: Abbrev Number: 3 (DW_TAG_variable)
    <1009>   DW_AT_name        : (indirect string, offset: 0x91694): delay_active
    <100d>   DW_AT_decl_file   : 1
    <100d>   DW_AT_decl_line   : 13
    <100e>   DW_AT_decl_column : 18
    <100f>   DW_AT_type        : <0xfd5>
    <1013>   DW_AT_external    : 1
    <1013>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><1019>: Abbrev Number: 3 (DW_TAG_variable)
    <101a>   DW_AT_name        : (indirect string, offset: 0x91670): delay_target_ms
    <101e>   DW_AT_decl_file   : 1
    <101e>   DW_AT_decl_line   : 14
    <101f>   DW_AT_decl_column : 10
    <1020>   DW_AT_type        : <0xfda>
    <1024>   DW_AT_external    : 1
    <1024>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><102a>: Abbrev Number: 9 (DW_TAG_subprogram)
    <102b>   DW_AT_external    : 1
    <102b>   DW_AT_name        : (indirect string, offset: 0x914f5): Delay_ms
    <102f>   DW_AT_decl_file   : 1
    <1030>   DW_AT_decl_line   : 16
    <1031>   DW_AT_decl_column : 6
    <1032>   DW_AT_prototyped  : 1
    <1032>   DW_AT_low_pc      : 0x800044c
    <1036>   DW_AT_high_pc     : 0x50
    <103a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <103c>   DW_AT_call_all_calls: 1
 <2><103c>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <103d>   DW_AT_name        : ms
    <1040>   DW_AT_decl_file   : 1
    <1041>   DW_AT_decl_line   : 16
    <1042>   DW_AT_decl_column : 24
    <1043>   DW_AT_type        : <0xfda>
    <1047>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><104a>: Abbrev Number: 4 (DW_TAG_variable)
    <104b>   DW_AT_name        : (indirect string, offset: 0x9168e): start
    <104f>   DW_AT_decl_file   : 1
    <104f>   DW_AT_decl_line   : 18
    <1050>   DW_AT_decl_column : 14
    <1051>   DW_AT_type        : <0xfda>
    <1055>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><1058>: Abbrev Number: 4 (DW_TAG_variable)
    <1059>   DW_AT_name        : (indirect string, offset: 0x91669): target
    <105d>   DW_AT_decl_file   : 1
    <105d>   DW_AT_decl_line   : 19
    <105e>   DW_AT_decl_column : 14
    <105f>   DW_AT_type        : <0xfda>
    <1063>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><1066>: Abbrev Number: 11 (DW_TAG_lexical_block)
    <1067>   DW_AT_ranges      : 0x8a
 <3><106b>: Abbrev Number: 4 (DW_TAG_variable)
    <106c>   DW_AT_name        : (indirect string, offset: 0x91680): elapsed
    <1070>   DW_AT_decl_file   : 1
    <1070>   DW_AT_decl_line   : 23
    <1071>   DW_AT_decl_column : 18
    <1072>   DW_AT_type        : <0xfda>
    <1076>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><1079>: Abbrev Number: 0
 <2><107a>: Abbrev Number: 0
 <1><107b>: Abbrev Number: 0
  Compilation Unit @ offset 0x107c:
   Length:        0x249 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x509
   Pointer Size:  4
 <0><1088>: Abbrev Number: 12 (DW_TAG_compile_unit)
